window.CHAPTERS_CONFIG = [
  { "text": "سرورق", "link": "front-cover" },
  { "text": "صفحہ عنوان", "link": "title-page" },
  { "text": "یہ وہ گوہر شاہی ہیں", "link": "this-is-that-gohar-shahi" },
  { "text": "پیش لفظ", "link": "preface" },
  { "text": "دیباچہ از ریاض احمد گوھر شاہی", "link": "introduction-by-ra-gohar-shahi" },
  { "text": "انسان ازل سے ابد تک", "link": "man-since-creation-to-infinite" },
  { "text": "دنیا میں انسان کی بنیاد", "link": "roots-of-man-in-the-world" },
  { "text": "تذکرۂ نفس", "link": "the-doctrine-of-nafs-(the-self)" },
  { "text": "لطیفہ قلب", "link": "the-subtlety-of-qalb" },
  { "text": "انسانی روح", "link": "the-human-soul" },
  { "text": "لطیفہ سری", "link": "the-subtlety-of-sirri-(secret)" },
  { "text": "لطیفہ خفی", "link": "the-subtlety-of-khafi-(arcane)" },
  { "text": "لطیفہ اخفیٰ", "link": "the-subtlety-of-akhfa-(obscure)" },
  { "text": "لطیفہ انا", "link": "the-subtlety-of-ana" },
  { "text": "انسانی جسم میں ان لطائف کی ڈیوٹیاں", "link": "functions-of-subleties-in-the-human-body" },
  { "text": "لفظ اللہ", "link": "the-word-allah" },
  { "text": "نور بنانے کا طریقہ", "link": "the-method-of-producing-divine-light" },
  { "text": "بابت مراقبہ", "link": "chapter-of-muraqibah-(transcendental-meditation)" },
  { "text": "بہشت کن لوگوں کے لئے ہے", "link": "who-deserves-the-paradise" },
  { "text": "تقویٰ کن لوگوں کے لئے ہے", "link": "which-individuals-qualify-for-taqwa-(piety)" },
  { "text": "تقدیر", "link": "taqdir-(the-fate)" },
  { "text": "تیسری ارواح", "link": "third-category-of-the-soul" },
  { "text": "سوچ تو ذرا تو کس آدم کی اولاد میں سے ہے؟", "link": "ponder-progeny-of-which-of-the-many-adams-do-you-come-from" },
  { "text": "مریخ میں انسانی زندگی ابھی بھی موجود ہے جبکہ سورج میں بھی آتشی مخلوق آباد ہے", "link": "human-life-exists-on-mars-creatures-made-of-fire-live-on-the-sun" },
  { "text": "آسمان پر روحیں حد سے زیادہ بن گئی تھیں:", "link": "the-number-of-souls-created-in-the-heaven-exceeded-the-limit" },
  { "text": "تصوف میں اہمیت قلب کو ہے", "link": "the-heart-has-the-central-and-very-important-role-in-spirituality" },
  { "text": "دین ِ الٰہی", "link": "the-religion-of-god" },
  { "text": "آخری زمانہ میں", "link": "in-the-end-times" },
  { "text": "روحوں کا دین", "link": "religion-of-souls" },
  { "text": "فرموداتِ گوہر شاہی 1", "link": "utterances-of-his-divine-eminence-ra-gohar-shahi-1" },
  { "text": "امام مہدی تمام مذاہب کی تجدید کرینگے", "link": "imam-mehdi-will-rejuvenate-all-the-religions" },
  { "text": "فرموداتِ گوہر شاہی 2", "link": "utterances-of-his-divine-eminence-ra-gohar-shahi-2" },
  { "text": "صراط مستقیم", "link": "sirat-al-mustaqeem-(straight-path-leading-to-god)" },
  { "text": "اللہ کا دوست", "link": "the-friend-of-god" },
  { "text": "گوہرشاہی کا عالمِ انسانیت کے لئے انقلابی پیغام", "link": "his-divine-eminence-gohar-shahis-revolutionary-message-to-humankind" },
  { "text": "گوہرشاہی کا عقیدہ", "link": "the-tenet-of-his-divine-eminence-gohar-shahi" },
  { "text": "رسولوں کے کلمے یہ ہیں", "link": "declaration-of-the-mursaleen-(the-grand-prophets)" },
  { "text": "چند محب ارواح کے چشم دید واقعے", "link": "eye-witness-accounts-of-a-few-selected-loving-souls" },
  { "text": "حضرت ریاض احمد گوہرشاہی کا شخصی تعارف", "link": "introduction-to-the-person-of-his-divine-eminence-ra-gohar-shahi" },
  { "text": "حضرت گوہرشاہی کی باطنی شخصیت کے چند حقائق", "link": "some-selected-features-of-his-divine-eminence-ra-gohar-shahis-esoteric-personality" },
  { "text": "’’جشن ِشاہی منانے کی وجوہات‘‘", "link": "what-jashan-e-shahi-and-the-reasons-why-it-is-celebrated" },
  { "text": "چاند اور سورج پر تصاویر کے بارے میں مکمل وضاحت", "link": "exhaustive-explanation-about-the-images-on-the-sun-and-the-moon" },
  { "text": "منجانب اللہ تصاویرِ گوہر شاہی کا ظہور", "link": "miraculous-images-of-his-divine-eminence-ra-gohar-shahi" },
  { "text": "چاند", "link": "moon" },
  { "text": "سورج", "link": "sun" },
  { "text": "خلاء", "link": "space" },
  { "text": "حجرِ اسود", "link": "black-stone" },
  { "text": "نبیولا", "link": "nebula" },
  { "text": "مریخ", "link": "mars" },
  { "text": "مریخ اوردیگر سیاروں پر شبیہ کا راز", "link": "an-insight-into-the-manifestation-of-human-images-in-the-moon-mars-and-various-other-planets" },
  { "text": "اپیل", "link": "appeal" },
  { "text": "شو مندر، عمر کوٹ", "link": "shivling" },
  { "text": "دیس پردیس اخبار لندن", "link": "des-pardes" },
  { "text": "کرشمۂ قدرت", "link": "a-divine-phenomenon" },
  { "text": "عیسیٰ علیہ السلام کی حضرت ریاض احمد گوہر شاہی سے امریکہ میں ملاقات", "link": "the-return-of-jesus-jesus-christ-meets-gohar-shahi-in-america" },
  { "text": "فرمان ِ گوہرشاہی", "link": "utterances-of-his-divine-eminence-ra-gohar-shahi-3" },
  { "text": "پروگرام", "link": "programs" },
  { "text": "تریاقِ قلب", "link": "taryaq-e-qalb" },
  { "text": "کتاب کی روشناس کے لئے چند اقتباس", "link": "the-excerpts-from-the-book-for-quick-awareness" }
];

window.PRELOADED_TEXTS = {
  "front-cover": {
    "title": "سرورق",
    "sentences": [
      "دینِ الٰہی",
      "Deen e Ilahi Urdu Book Front Cover"
    ]
  },
  "title-page": {
    "title": "مصنف دین الٰہی",
    "sentences": [
      "حضرت ریاض احمد گوہر شاہی",
      "مصنف دین الٰہی",
      "اور تم دیکھو گے لوگوں کو دینِ الٰہی میں فوج در فوج داخل ہوتے ہوئے (سورۃ النصر)",
      "دینِ الٰہی",
      "خدا کے پوشیدہ راز",
      "تصنیفِ ہذا کے جملہ حقوق محفوظ ہیں",
      "یہ کتاب اللہ کے متلاشیوں اور اللہ سے محبت کرنے والوں کیلئے ایک تحفہ ہے",
      "اطلاع برائے ذاکرین:",
      "یہ کتاب حق پرستوں، منصف مزاج لوگوں اور اللہ کے طالبوں تک پہنچانی ہے۔",
      "ازلی منافق اس کو تلف کرنے کی کوشش کریں گے",
      "مرتب کردہ:",
      "محمد یونس الگوہر (لندن)",
      "ام"
    ]
  },
  "this-is-that-gohar-shahi": {
    "title": "this-is-that-gohar-shahi",
    "sentences": [
      "یہ وہ گوہر شاہی ہیں جنہوں نے تین سال تک سیہون شریف کی پہاڑیوں اور لال باغ میں اللہ کے عشق کی خاطر چلہ کشی کری ۔",
      "اللہ کو پانے کی خاطر دنیا چھوڑی، پھر اللہ کے حکم ہی سے دوبارہ دنیا میں آئے۔",
      "لاکھوں دلوں میں اللہ کا ذکر بسایا اور لوگوں کو اللہ کی محبت کی طرف راغب کیا۔",
      "ہر مذہب والوں نے گوہر شاہی کو مسجدوں، مندروں، گردواروں اور گرجا گھروں میں روحانی خطاب کیلئے مدعو کیا اور ذکر قلب حاصل کیا بے شمار مرد و زن ان کی تعلیم سے گناہوں سے تائب ہوئے اوراللہ کی طرف جھک گئے۔",
      "بے شمارلاعلاج مریض انکے روحانی علاج سے شفایاب ہوئے، پھر اللہ نے ان کا چہرہ چاند پر دکھایا، پھر حجر اسود میں بھی ان کی تصویر ظاہر ہوئی، پوری دنیا میں ان کی شہرت ہوگئی۔",
      "لیکن کور چشم مولویوں کو اور ولیوں سے حسدوبُغض رکھنے والے مسلمانوں کو یہ شخص پسند نہ آیا، ان کی کتابوں کی تحریروں میں خیانت کرکے ان پر کفر اور واجب القتل کے فتوے لگائے۔",
      "مانچسٹر میں ان کی رہائش گاہ پر پٹرول بم پھینکا ، کوٹری میں دوران ِ خطاب اِن پر ہینڈ گرینیڈ بم سے حملہ کیا گیا ۔",
      "لاکھوں روپے ان کے سر کی قیمت رکھی گئی۔",
      "پانچ قسم کے سنگین جھوٹے مقدمات، اندرون ِملک ان کو پھنسانے کے لئے قائم کئے گئے ۔",
      "نوازشریف کی وجہ سے حکومت ِسندھ بھی شامل ہو گئی تھی دو کیس قتل ، ناجائز اسلحہ، ناجائز قبضہ کا دفعہ بھی لگایا گیا ۔",
      "امریکہ میں بھی ایک عورت سے زیادتی اور حبس ِبیجا کا مقدمہ بنایا گیا ۔",
      "زرد صحافت نے انہیں زمانے میں خوب بدنام کیا ، لیکن آخر میں عدالتوں نے شنوائی اور تحقیقات کے بعد تمام مقدمات جھوٹے قرار دے کر خارج کر دیئے اور اللہ نے اپنے اس دوست کو ہر مصیبت سے بچائے رکھا۔",
      "اِن مقدمات کے بارے میں ہائی کورٹ کی رپورٹ ملاحظہ ہوکہ",
      "’’ گوہرشاہی کو فرقہ واریت کی وجہ سے بار بار پھنسایا جاتا ہے‘‘",
      "خصوصی نوٹ"
    ]
  },
  "preface": {
    "title": "پیش لفظ",
    "sentences": [
      "پیش لفظ",
      "چاند، سورج ، حجر اسود، شِومندر اور کئی دوسرے مقامات پر بھی تصویر گوہر شاہی نمایاں ہونے کے بعد اکثر مسلم اور غیر مسلم کا خیال اور یقین ہے کہ یہی شخص مہدی، کالکی اوتار اور مسیحا ہے جسکا مختلف مذہبی کتابوں میں ذکر آیا ہے۔",
      "آیئے !آپ بھی اِن کو پرکھنے کی کوشش کریں اور ہم سے تحقیق کے لئے رابطہ کریں اور اِن کی کتب کے ذریعہ بھی اِن کو پہچاننے کی کوشش کریں ۔",
      "محمد یونس الگوہر",
      "(لندن انگلینڈ)"
    ]
  },
  "introduction-by-ra-gohar-shahi": {
    "title": "دیباچہ",
    "sentences": [
      "دیباچہ",
      "از ریاض احمد گوہر شاہی",
      "1. جو مذاہب آسمانی کتابوں کے ذریعے قائم ہوے وہ درست ہیں  بشرطیکہ ان میں ردوبدل نہ کی گئی ہو۔",
      "2.  مذاہب کشتی اور علماء ملاح کی طرح ہوتے ہیں، اگر کسی ایک میں بھی نقص ہو تو منزل پر پہنچنا مشکل ہے۔",
      "البتہ اولیاء ٹوٹی پھوٹی  کشتی  کو بھی کنارے لگا دیتے ہیں ، یہی وجہ ہےکہ ٹوٹے پھوٹے لوگ اولیاء کے گرد جمع ہو جاتے ہیں۔",
      "3. مذہب سے بالاتر اللہ کی محبت ہے،  جو تمام مذاہب کا عرق ہے۔ جبکہ اللہ کا نور مشعلِ راہ ہے!",
      "4. تین حصے علمِ ظاہر کے اور ایک حصہ علمِ باطن کا ہے جو خضرؑ(وشنو مہاراج) کے ذریعے عام ہوا۔",
      "اللہ کی محبت ہی اللہ کے قرب کا ذریعہ ہے، جس دل میں خدانہیں کتے اُس سےبہتر ہیں،",
      "کیونکہ وہ اپنے مالک سے محبت کرتے ہیں اور محبت ہی کی وجہ سے مالک کاقرب حاصل کر لیتے ہیں",
      "ورنہ کہاں ایک نجس کتا اور کہاں حضرت ِ انسان!",
      "5. اگرتجھے جنت اور حوروقصور کی آرزو ہےتوخوب عبادت کر تاکہ اُونچی سےاُونچی جنت مل سکے!",
      "6. اگرتجھے اللہ کی تلاش ہے تو روحانیت بھی سیکھ تاکہ توصراط مستقیم پر گامزن ہوکر"
    ]
  },
  "man-since-creation-to-infinite": {
    "title": "انسان ازل سے ابد تک",
    "sentences": [
      "انسان ازل سے ابد تک",
      "جب اللہ نے روحوں کو بنانا چاہا تو کہا: کُن، تو بیشمار روحیں بن گئیں۔",
      "اللہ کے سامنے اور قریب ارواح نبیوں کی، پھر دوسری صف میں ولیوں کی، پھر تیسری صف میں مؤمنین کی، پھر ان کے پیچھے عام انسانوں کی، پھر حد ِنگاہ سے دور صف میں عورتوں کی روحیں بن گئیں ، پھر ان کے پیچھے روح  ِحیوانی،پھر روح  نباتی اور پھر ایسی روح جمادی جن میں ہلنے جلنے کی طاقت بھی نہ تھی، نمودار ہو گئیں ۔",
      "اللہ کے دائیں طرف فرشتوں کی اور پھر اس کے بعد حوروں کی ارواح تھیں، جو رب کے چہرے کو نہ دیکھ سکیں ، یہی وجہ ہے کہ فرشتے رب کا دیدار نہیں کر سکے۔",
      "پھر پیچھے نوری مؤکلات کی روحیں جو دنیا میں آکر نبیوں، ولیوں کی امدادی ہوئیں۔",
      "پھر بائیں جا نب جنات کی روحیں ، پھر پیچھے سفلی مؤکلات، پھر خبیثوں کی روحیں جودنیا میں آکر ابلیس کی امدادی ہوئیں ۔",
      "دائیں ، بائیں اور حدِنگاہ سے دور والی ارواح رب کا جلوہ نہ دیکھ سکیں۔",
      "یہی وجہ ہے کہ جن، فرشتے اور عورتیں رب سے ہمکلام ہو سکتے ہیں لیکن دیدار نہیں کر  سکتے۔کرۂ ارض میں ایک آگ کا گولہ تھا ، حکم ہوا : ٹھنڈا ہو جا!",
      "پھر اس کے ٹکڑے فِضا میں بکھر گئے۔",
      "چاند،مریخ، مشتری، یہ دنیا اور ستارے سب اسی کے ٹکڑے ہیں جبکہ سورج وہی باقی ماندہ گولہمل تو نہیں کیا تھا!",
      "پھر اس حجت کو پورا کرنے کیلئے روحوں کو نیچے اس دنیا میں بھیجا۔آدم ؑجنہیں شنکر جی بھی کہتے ہیں جنت کی مٹی سے ان کا جسم بنایا گیا۔",
      "پھر روح انسانی کے علاوہ کچھ اور مخلوقیں بھی اُس میں ڈال دی گئیں۔",
      "جب آدمؑ کا جسم بنایا جارہا تھا تو شیطان نے حسد سے تھوکا تھا، جو ناف کی جگہ گرا اور اس تھوک کے جراثیم بھی اس جسم میں شامل ہوگئے۔",
      "شیطان جنات قوم سے ہے۔ایک حدیث میں ہے کہ جب انسان پیدا ہوتا ہے تو اس کے ساتھ ایک شیطان جن بھی پیدا ہوتا ہے، جسم تو صرف مٹی کا مکان تھا جس کے اندر سولہ(۱۶) مخلوقوں کو بند کردیا، جبکہ خناس اور چار پرندے اور بھی ہیں۔",
      "آدمؑ کی بائیں پسلی سے عورت کی شکل میں مواد نکلا۔اس میں روح ڈال دی گئی جو مائی حوا بن گئی۔",
      "بعد میں بہشت سے نکال کرآدم ؑ کو سری لنکا اور مائی حوا کو جدہ میں اتارا گیا۔",
      "جن کے ذریعے ایشیائیوں کی پیدائش کا سلسلہ شروع ہوگیا، اور آسمان سے باقی روحیں بھی بتدریج آنا شروع ہوگئیں۔روحوں کی تعلیم و تربیت اور مدارج کیلئے مذاہب کی صورت میں مدرسے قائم ہوئے اور روز ازل کی تقدیر کے مطابق کوئی کسی مذہب میں اور کوئی  بے مذہب ہی رہیں۔",
      "اللہ کی محّب روحیں بھی اس دنیا میں آئیں کوئی مسلم کے گھر کوئی ہندوؤں، کوئی سکھوں اور کوئی عیسائیوں کے گھروں میں پیدا ہوگئیں اور اپنے مذہب کے ذریعے اللہ کو پانے کی کوشش کرنے لگیں یہی وجہ ہے کہ ہر مذہب کے خواص نے رہبانیت اختیار کی، کچھ لوگ کہتے ہیں کہ اسلام میں رہبانیت نہیں ہے یہ عقیدہ"
    ]
  },
  "roots-of-man-in-the-world": {
    "title": "دنیا میں انسان کی بنیاد",
    "sentences": [
      "دنیا میں انسان کی بنیاد",
      "پیٹ میں نطفۂ انسانی کے بعد خون کو اکھٹا کرنے کیلئے روح جمادی آتی ہے، پھر روح نباتی کے ذریعے بچہ پیٹ میں بڑھتا ہے۔چار ماہ کے بعد روح حیوانی جسم میں داخل کی جاتی ہے جس کے ذریعے بچہ پیٹ میں حرکت کرتا ہے، ان کو ارضی ارواح کہتے ہیں۔پھر پیدائش کے بعد روح انسانی دوسری مخلوقات کے ساتھ آتی ہے ان کو سماوی ارواح کہتے ہیں۔اگر بچہ پیدائش سے تھوڑی دیر پہلے ہی پیٹ میں مر جائے تو اس کا جنازہ نہیں ہوتا کہ وہ حیوان تھا۔",
      "پیدائش کے تھوڑی دیر بعد مرجائے تو اس کا جنازہ لازم ہے کہ وہ روح انسانی کی آمد کی وجہ سے انسان بن گیا تھا، اور نفس نے بھی مقام ناف پر اپنے ساتھیوں کے ساتھ ڈیرہ لگا لیا تھا۔اگر اس میں جمادی روح طاقتور ہے تو وہ پہاڑوں میں رہنا پسند کرتا ہے۔روح نباتی کی وجہ سے انسان پھولوں اور درختوں سے لگاؤ رکھتا ہے۔روح حیوانی کے غلبہ سے جانوروں سے پیار اور جانوروں جیسے کام کرتا ہے۔",
      "جبکہ نفس کی شکل کتے کی طرح ہوتی ہے اس کے غلبے سے کتوں جیسے کام اور کتوں سے پیار کرتا ہے۔اور بیداری ِ قلب سے انسان فرشتوں کی طرح بن جاتا ہے۔انسان کے مرنے کے بعد سماوی ارواح آسمانوں کو لوٹ جاتی ہیں جو ایک ہی جسم کیلئے مخصوص ہیں، ارضی روحیں بمعہ نفوس کے اسی دنیا میں رہ جاتی ہیں۔",
      "ارضی روحیں ایک سے دوسرے، پھر تیسرے جسم میں منتقل ہوتی رہتی ہیں کیونکہ انکا روز ِ محشر سے کوئی تعلق نہیں لیکن پاکیزہ نفس قبروں میں رہ کر لوگوں کو فیض پہنچاتے اور خود بھی بندگی کرتے رہتے ہیں جیسا کہ جب شب معراج میں حضور پاک موسیٰ کی قبر سے گزرے تو دیکھا موسیٰ اپنی قبر میں نماز پڑھ رہے ہیں جب آسمانوں پر پہنچے تو دیکھا موسیٰ وہاں بھی موجود ہیں۔بدکار لوگوں کے طاقتور نفس اپنے بچاؤ کیلئے شیاطین کے ٹولے سے مل جاتے ہیں اور لوگوں کے جسم میں داخل ہوکر لوگوں کو نقصان پہنچاتے ہیں انکو بد روحیں کہتے ہیں۔انجیل میں ہے کہ عیسیٰ بدروحیں نکالا کرتے تھے۔ارضی ارواح اور نفوس اسی دنیا میں ، روح انسانی عالم علِیین یا سجیین میں اور لطائف اگر طاقتور ہیں تو وہ بھی علِیین میں، ورنہ قبر میں ہی ضائع ہوجاتے ہیں۔",
      "نفس کی وجہ سے انسان ناپاک ہوا۔",
      "بقول بُلھے شاہ:\t اس نفس پلیت نے پلیت کیتا …… اساں مُنڈھوں پلیت نہ سی"
    ]
  },
  "the-doctrine-of-nafs-(the-self)": {
    "title": "تذکرۂ نفس",
    "sentences": [
      "تذکرۂ نفس",
      "یہ شیطانی جرثومہ ہے .ناف میں اس کا ٹھکانہ ہے .سب نبیوں ولیوں نے اس کی شرارت سے پناہ مانگی ، اس کی غذا فاسفورس اور بدبو ہے، جو ہڈیوں، کوئلے اور گوبر میں بھی ہوتی ہے َہر مذہب نے جنابت کے بعد نہانے پر زور دیا ہے۔",
      "باقاعدہ سائنسی تحقیق کے مطابق، کیونکہ جنابت کی بدبو مساموں سے بھی خارج ہوتی ہے۔",
      "بد بودار قسم کے مشروب اور بد بو دار قسم کے جانوروں کے گوشت کو بھی ممنوع قرار دیاہے .",
      "روز ازل میں اللہ کے سامنے والی تمام روحیں، جمادی تک، ایک دوسرے سے مانوس اور متحد ہوگئیں۔روح جمادی کی وجہ سے انسان نے پتھروں کے مکان بنائے اور روح نباتی کی وجہ سے درختوں کی لکڑیوں سے چھت بنائے .درختوں کے سائے سے بھی مستفیض ہوئے، درختوں نے ان کو صاف سُتھری آکسیجن پہنچائی۔پیچھے والی حیوانی روحیں جو دنیا میں آکر جانور بن گئے، سب انسانوں کیلئے حلال کردیئے گئے۔جبکہ ان ہی سے متعلقہ پرندے بھی حلال کردئیے گئے .بائیں طرف جنات اور سفلی مؤکلات بنے پھر اُن سے پیچھے کی طرف خبیث ارواح جو آخر میں دشمن خدا ہوئیں۔اور وہ حیوانی، نباتی اور جمادی روحیں جو خبیثوں کے پیچھے نمودار ہوئیں تھیں انہوں نے انسانوں سے دشمنی کری ، ان کی روح جمادی کے دنیا میں آنے سے راکھ کوئلہ بنی، جس کی گیس انسانوں کے لئے نقصان دہ تھی۔",
      "اُن کی ن کا خادم، پیغام رساں اور مددگار بنادیا اور انسان کو سب سے زیادہ فضیلت عطا کرکے اپنا خلیفہ مقرر کردیا۔اب انسان کی مرضی، محنت اور قسمت ہے کہ خلافت منظور کرے یا ٹھکرا دے۔",
      "نفس خواب میں جسم سے باہر نکل جاتا ہے اور اس بندے کی شکل میں جنات کی شیطانی محفلوں میں گھومتا ہے۔",
      "نفس کے ساتھ خناس بھی ہوتا ہے جس کی شکل ہاتھی کی طرح ہوتی ہے اور یہ نفس اور قلب کے درمیان بیٹھ جاتا ہے، انسان کو گمراہ کرنے کیلئے نفس کی مدد کرتا ہے۔",
      "اس کے علاوہ چار پرندے بھی انسان کو گمراہ کرنے کیلئے چاروں لطائف کے ساتھ چمٹ جاتے ہیں، جیسا کہ قلب کے ساتھ مرغ، جس کی وجہ سے دل پر شہوت کا غلبہ رہتا ہے، قلب کے ذکر سے وہ مرغ، مرغ ِ بسمل بن جاتا ہے اور حرام وحلال کی تمیز کا شعور پیدا کردیتا ہے۔پھر اس قلب کو قلب ِ سلیم کہتے ہیں۔",
      "سری کے ساتھ کوا،کوے کی وجہ سے حرص، اور خفی کے ساتھ مور، مور کی وجہ سے حسد، اور اخفیٰ کے ساتھ کبوتر، کبوتر کی وجہ سے بُخل آجاتا ہے اور اُن کی خصلتیں لطائف کو حرص و حسد پر مجبور کردیتی ہیں جب تک لطائف منور نہ ہوجائیں۔ابراہیم ؑ کے جسم سے ان ہی چار پرندوں کو نکال کر، پاکیزہ کرکے دوبارہ جسم میں ڈالا گیا تھا۔مرنے کے بعد پاکیزہ لوگوں کے یہ پرندے درختوں پر بسیرا بنالیتے ہیں۔بہت سے لوگ جنگلوں میں کچھ دن رہ کر پرندوں جیسی آوازیں نکالتے ہیں، اور یہ پرندے ان سے مانوس ہوجاتے ہیں اور اُن کے"
    ]
  },
  "the-subtlety-of-qalb": {
    "title": "لطیفہ قلب",
    "sentences": [
      "لطیفہ قلب",
      "گوشت کے لوتھڑے کو اُردو میں دِل اور عربی میں فواد بولتے ہیں اور اس مخلوق کو جو دِل کے ساتھ ہے، قلب بولتے ہیں۔اس کی نبوت اور علم آدمؑ کو ملا تھا۔",
      "حدیث میں ہے کہ دِل اور قلب میں فرق ہے۔",
      "اس دنیا کو ناسوت بولتے ہیں۔اس کے علاوہ اورجہان بھی ہیں، یعنی ملکوت، عنکبوت، جبروت, لاہوت، وحدت اور احدیت۔",
      "یہ مقام ناسوت میں گولہ پھٹنے سے پہلے تھے اور ان کی مخلوقیں بھی پہلے سے موجود تھیں.فرشتے ارواح کے ساتھ بنے۔",
      "لیکن ملائکہ اور لطائف پہلے ہی سے ان مقامات پر موجود تھے بعد میں عالم ِ ناسوت میں بھی کئی سیاروں پر دنیا آباد ہوئی۔کوئی مٹ گئے اور کوئی منتظر ہیں۔",
      "یہ مخلوق یعنی لطائف اور ملائکہ روحوں کے امر کن سے ۷۰ ہزار سال پہلے بنائے گئے تھے اور ان میں سے قلب کو مقام ِ محبت میں رکھا گیا اور اسی کے ذریعے انسان کا رابطہ اللہ سے جڑ جاتا ہے۔اللہ اور بندے کے درمیان یہ ٹیلی فون آپریٹر کی حیثیت رکھتا ہے۔",
      "انسان پر دلیل و الہامات اسی کے ذریعے وارد ہوتے ہیں۔جبکہ لطائف کی عبادات بھی اسی کے ذریعے عرش ِ بالا پر پہنچتی ہیں لیکن یہ مخلوق خود ملکوت سے آگے نہیں جاسکتی، اس کا مقام خلد ہے۔",
      "اس کی عبادت بھی اندر اور تسبیح بھی انسان کے ڈھانچے میں ہے۔",
      "اس کی عبادت کے بغیر والے جنتی بھی افسوس کرینگے کیونکہ اللہ نے فرمایا کہ’’ کیا ان لوگوں نے سمجھ رکھا ہے کہ ہم ان کو نیکوکاروں کے برابر کردینگے؟‘‘ کیونکہ قلب بھی روح انسانی کے ساتھ دیدار والے لافانی ولیوں کے جسم میں داخل ہونگے گے۔جنہوں نے ان کو دنیا میں اللہ اللہ سکھایا تھا وہاں بھی اللہ اللہ کرتے رہیں گے اور وہاں جاکر بھی ان کے مرتبے بڑھتے رہیں گے۔",
      "اور جو ادھر دِل کے اندھے تھے وہ اُدھر بھی اندھے ہی رہیں گے۔",
      "کیونکہ میدان عمل یہ دنیا تھی اور وہ ایک ہی جگہ ساکن ہوجائینگے۔عیسائیوں، یہودیوں کے علاوہ ہندو مذہب بھی ان مخلوقوں کا قائل ہے۔",
      "ہندو  اِنہیں شکتیاں اور مسلمان انہیں لطائف کہتے ہیں۔",
      "قلب دل کے بائیں طرف دو انچ کے فاصلے پر ہوتا ہے اس مخلوق کا رنگ زرد ہے۔",
      "اس کی بیداری سے انسان زرد روشنی اپنی آنکھوں میں محسوس کرتا ہے۔بلکہ کئی عامل حضرات ان لطائف کے رنگوں سے لوگوں کا علاج بھی کرتے ہیں۔اکثر لوگ اپنے دِل کی بات برحق مانتے ہیں۔اگر واقعی دِل سچے ہیں تو سب دِل والے ایک کیوں نہیں؟",
      "عام آدمی کا قلب صنوبری ہوتا ہے جس میں کوئی سُدھ بُدھ نہیں ہوتی، نفس اور خناس کے غلبے یا اپنے سیدھے پن کی وجہ سے غلط فیصلہ بھی دے سکتا ہے۔قلب صنوبری پر اعتماد نادانی ہے۔جب اس دِل میں اللہ کا ذکر شروع ہوجاتا ہے پھر اس میں نیکی بدی کی تمیز اور سمجھ آجاتی ہے اِسے قلب سلیم کہتے ہیں، پھر ذکر کی کثرت سے اس کا رُخ رب کی طرف مُڑ جاتا ہے اِسے قلبِ منیب کہتے ہیں، یہ دِل برائی سے روک سکتا ہے مگر یہ صحیح فیصلہ نہیں کر سکتا، پھر جب اللہ تعالیٰ کی تجلیات اس دِل پر گرنا شروع ہوجاتی ہیں تو اُسے قلب شہید کہتے ہیں۔",
      "حدیث : شکستہ دِل"
    ]
  },
  "the-human-soul": {
    "title": "انسانی روح",
    "sentences": [
      "انسانی روح",
      "اِس کی نبوت اور علم ابراہیم ؑ کو ملا تھا",
      "یہ دائیں پستان کے قریب ہوتی ہے۔",
      "ذکر کی ضربوں اور تصور سے اس کو بھی جگایا جاتا ہے۔پھر اِدھر بھی ایک دھڑکن نمایاں ہوجاتی ہے۔",
      "اس کے ساتھ( ذکر) یااللہ ملایا جاتا ہے پھر انسان کے اندر دو بندے ذکر کرنا شروع کردیتے ہیں اور اس کا مرتبہ قلب والے سے بڑھ جاتا ہے۔",
      "روح کا رنگ سُرخی مائل ہوتا ہے اور اس کی بیداری سے جبروت تک (جو مقام ِ جبرائیل ہے) رسائی ہوجاتی ہے۔",
      "غضب و غصّہ اس کے ہمسایہ ہوتے ہیں جو جل کر جلال بن جاتے ہیں۔"
    ]
  },
  "the-subtlety-of-sirri-(secret)": {
    "title": "لطیفہ سری",
    "sentences": [
      "لطیفہ سری",
      "اس کی نبوت اور علم موسیٰ ؑ کو ملا تھا",
      "یہ مخلوق سینے کے درمیان سے بائیں پستان کے درمیان ہوتی ہے۔",
      "اس کو بھی یاحّی و یا قیوم کی ضربوں اور تصّور سے بیدار کیا جاتا ہے۔",
      "اس کا رنگ سفید ہے۔",
      "خواب یا مراقبے میں لاہوت تک پہنچ رکھتی ہے، اب تین مخلوقیں ذکر کررہی ہیں اور اس کا درجہ اُن دو سے بڑھ گیا۔"
    ]
  },
  "the-subtlety-of-khafi-(arcane)": {
    "title": "لطیفہ خفی",
    "sentences": [
      "لطیفہ خفی",
      "اس کی نبوت اور علم عیسیٰ کو ملا تھا",
      "یہ سینے کے درمیان سے دائیں پستان کے درمیان ہوتی ہے اسے بھی ضربوں کے ذریعے یاواحد سکھایا جاتا ہے۔اس کا رنگ سبز ہے اور اس کی رسائی مقام وحدت سے ہے، اور اب چار بندوں کی عبادت سے درجہ اور بڑھ گیا۔"
    ]
  },
  "the-subtlety-of-akhfa-(obscure)": {
    "title": "لطیفہ اخفیٰ",
    "sentences": [
      "لطیفہ اخفیٰ",
      "اس کی نبوت اور علم حضور پاک کو ملا تھا",
      "یہ مخلوق سینے کے درمیان ہے۔",
      "یا احد کا ذکر اس کیلئے وسیلہ ہے اس کا رنگ جامنی ہے اس کا تعلق بھی مقام وحدت کے اُس پردے سے ہے جس کے پیچھے تخت خداوند ہے۔",
      "پانچ لطیفوں کا باطنی علم بھی پانچوں نبیوں کو بالترتیب حاصل ہوا اور ہر لطیفے کا آدھا علم نبیوں سے ولیوں تک پہنچا۔",
      "اس طرح اس کے دس  حصّے بن گئے پھر ولیوں سے خاص(لوگ) اس علم سے مستفیض ہوئے۔",
      "جبکہ ظاہری علم، ظاہری جسم، ظاہری زبان، ناسوت اور نفوس سے تعلق رکھتا ہے۔",
      "یہ عام لوگوں کیلئے ہے اور اس کا علم ظاہری کتاب میں ہے جس کے تیس (۳۰)حصے ہیں .علم باطن بھی نبیوں پر وحی کے ذریعے نازل ہوا، اِس وجہ سے اِسے بھی باطنی قرآن بولتے ہیں۔قرآن کی بہت سی صورتیں بعد میں منسوخ کی جاتیں ، اُس کی وجہ یہی تھی کہ کبھی کبھی سینے کا علم بھی حضورؐ کی زبان سے عام میں ادا ہوجاتا جو کہ خاص کیلئے تھا، بعد میں یہ علم سینہ بہ سینہ ولیوں میں چلتا رہا اور اب کتب کے ذریعے عام کردیا گیا۔"
    ]
  },
  "the-subtlety-of-ana": {
    "title": "لطیفہ انا",
    "sentences": [
      "لطیفہ انا",
      "یہ مخلوق سر میں ہوتی ہے۔",
      "بے رنگ ہے۔",
      "\"یاھو\" کا ذکر اس کی معراج ہے اور یہی مخلوق طاقتور ہوکر خدا کے رُوبرو بے پردہ  ہمکلام ہوجاتی ہے۔یہ عاشقوں کا مقام ہے اس کے علاوہ کچھ خواص کو اللہ کی طرف سے اور دیگر مخلوقیں بھی عطا ہوجاتی ہیں، جیسے \"طفل ِ نوری\" یا  \"جُسہ ٔ توفیق الٰہی\"۔",
      "پھر ان کا مرتبہ سمجھ سے بالا ہے۔",
      "لطیفہ انا کے ذریعے دیدار ِ الٰہی خواب میں ہوتا ہے",
      "جسۂ توفیق الٰہی کے ذریعے رب کا دیدار مراقبے میں ہوتا ہے",
      "اور طفل نوری والوں کا دیدار ہوش و حواس میں ہوتا ہے",
      "یہی پھر دنیا میں قدرت اللہ کِہلاتے ہیں، چاہے کسی کو عبادت و ریاضت، اور چاہے کسی کو نظروں سے ہی مقام محمود تک پہنچا دیں، اِن کی نظروں میں :  چہ مسلم چہ کافر… چہ زندہ چہ مردہ ،سب برابر ہوتے ہیں جیسا کہ غوث پاکؓ کی ایک نظر سے چور قطب بن گیا۔",
      "یا ابوبکر حواری یا منگا ڈاکو بھی ان لوگوں کی نظروں سے پیر بن گئے۔",
      "پانچوں مُرسل کو بالترتیب علیحدہ علیحدہ لطائف کا علم دیا گیا جس کی وجہ سے روحانیت میں ترقی ہوتی گئی .جس جس لطیفے کا ذکر کریگا اُن سے متعلق مُرسل سے تعلق اور فی"
    ]
  },
  "functions-of-subleties-in-the-human-body": {
    "title": "انسانی جسم میں ان لطائف کی ڈیوٹیاں",
    "sentences": [
      "انسانی جسم میں ان لطائف کی ڈیوٹیاں",
      "لطیفہ اخفٰی:",
      "اسکے ذریعے انسان بولتا ہے ورنہ زبان ٹھیک ہونے کے باوجود وہ گونگا ہے۔",
      "انسانوں اور حیوانوں میں فرق ان لطائف کا ہے۔پیدائش کے وقت اگر اخفیٰ کسی وجہ سے جسم میں داخل نہ ہوسکے تو اسے جسم میں منگوانا کسی متعلقہ نبی کی ڈیوٹی تھی، پھر گونگے بولنا شروع ہوجاتے تھے۔",
      "لطیفہ سری:",
      "اسکے ذریعے انسان دیکھتا ہے۔",
      "اس کے جسم میں نہ آنے سے انسان پیدائشی اندھا ہے اس کو واپس لانا بھی کسی متعلقہ نبی کی ڈیوٹی تھی جس سے اندھے بھی دیکھنا شروع ہو جاتے تھے۔",
      "لطیفہ قلب:",
      "اسکے جسم میں نہ ہونے کی وجہ سے انسان بالکل جانوروں کی طرح رب سے ناآشنا اور دُور، بے شوق، بے کیف ہوجاتا ہے، اس کو واپس دِلوانا بھی نبیوں کا کام تھا۔",
      "اور اُن نبیوں کے معجزات کرامت کی صورت میں ولیوں کو بھی عطا ہوئے، جس کے ذریعے فاسق و فاجر بھی رب تک پہنچ گئے۔",
      "کسی بھی ولی یا نبی کے ذریعے جب کسی متعلقہ لطیفے کو واپس کیا جاتا ہے تو گونگے بہرے اور اندھے بھی شفا یاب ہوجاتے ہیں۔",
      "لطیفہ انا:",
      "اس کے جسم میں نہ آنے سے انسان پاگل کہلاتا ہے بے شک دماغ کی سب نسیں کام کررہیں ہوں۔",
      "لطیفہ خفی:",
      "اس"
    ]
  },
  "the-method-of-producing-divine-light": {
    "title": "نور بنانے کا طریقہ",
    "sentences": [
      "نور بنانے کا طریقہ",
      "پرانے زمانے میں پتھروں کی رگڑ سے آگ حاصل کی جاتی تھی جبکہ لوہے کی رگڑ سے بھی چنگاری اُٹھتی ہے۔",
      "پانی سے پانی ٹکرایا تو بجلی بن گئی۔",
      "اِسی طرح انسان کے اندر خون کے ٹکراؤ یعنی دِل کی ٹک ٹک سے بھی بجلی بنتی ہے۔ہر انسان کے جسم میں تقریباً ڈیڑھ والٹ بجلی موجود ہے۔جس کے ذریعے اس میں پھرتی ہوتی ہے۔بڑھاپے میں ٹک ٹک کی رفتار سُست ہونے کی وجہ سے بجلی میں بھی اور چستی میں بھی کمی آجاتی ہے۔سب سے پہلے دِل کی دھڑکنوں کو نمایاں کرنا پڑتا ہے۔",
      "کوئی ڈانس کے ذریعے، کوئی کبڈی یا ورزش کے ذریعے، اور کوئی اللہ اللہ کی ضربوں کے ذریعے یہ عمل کرتے ہیں۔جب دِل کی دھڑکنوں میں تیزی آجاتی ہے پھر ہر دھڑکن کے ساتھ اللہ اللہ، یا ایک کے ساتھ اللہ اور دوسری کے ساتھ’’ ھو‘‘ ملائیں۔",
      "کھی کبھی دِل پر ہاتھ رکھیں، دھڑکنیں محسوس ہوں تو اللہ ملائیں۔کھی کبھی نبض کی رفتار کے ساتھ ا للہ ملائیں۔تصور کریں کہ اللہ دِل میں جارہا ہے۔اللہ ھو کا ذکر بہتر اور زود اثر ہے۔",
      "اگر کسی کو ’’ ھو ‘‘ پر اعتراض یا خوف ہو تو وہ بجائے محرومی کے دھڑکنوں کے ساتھ اللہ اللہ ہی ملاتے رہیں۔",
      "وِرد و وظائف اور ذکوریت والے لوگ جتنا بھی پاک صاف رہیں ان کیلئے بہتر ہے، کہ بے ادب… بے مراد…… باادب… بامراد…",
      "پہلا طریقہ:",
      "کاغذ پر کالی پنسل سے اللہ لکھیں، جتنی دیر"
    ]
  },
  "chapter-of-muraqibah-(transcendental-meditation)": {
    "title": "بابت مراقبہ",
    "sentences": [
      "بابت مراقبہ",
      "بہت سے لوگ روحوں ( لطائف ، شکتیاں) کی بیداری اور روحانی طاقت سیکھے بغیر مراقبہ کرنے کی کوشش کرتے ہیں۔ان کا یا تو مراقبہ لگتا ہی نہیں یا شیطانی وارداتیں شروع ہوجاتی ہیں۔",
      "مراقبہ انتہائی لوگوں کا کام ہے جنکے نفس پاک اور قلب صاف ہوچکے ہوں۔عام لوگوں کا مراقبہ نادانی ہے خواہ کسی بھی ظاہری عبادت سے کیوں نہ ہو!",
      "روحوں کی طاقت کو نور سے یکجا کرکے کسی مقام پر پہنچ جانے کا نام مراقبہ ہے۔ولائت نبوت کا چالیسواں حصّہ ہے.",
      "نبی کا ہر خواب،مراقبہ یا الہام وحی صحیح ہوتا ہے اِسے تصدیق کی ضرورت نہیں۔لیکن ولی کے سو(۱۰۰) میں سے چالیس(۴۰) خواب مراقبے یا الہامات صحیح اور باقی غلط ہوتے ہیں اور اِن کی تصدیق کیلئے علم باطن کی ضرورت ہے کہ: بے علم نتواں خدارا شناخت.",
      "سب سے ادنیٰ مراقبہ قلب کی بیداری کے بعد لگتا ہے جو کہ ذکر قلب کے بغیر ناممکن ہے۔ایک جھٹکے سے آدمی ہوش و حواس میں آجاتا ہے۔استخارے کا تعلق بھی قلب سے ہے۔",
      "اس سے آگے روح کے ذریعے مراقبہ لگتا ہے۔تین جھٹکوں سے واپسی ہوتی ہے۔تیسرا مراقبہ لطیفہ انا اور روح سے اکھٹا لگتا ہے۔",
      "روح بھی جبروت تک ساتھ جاتی ہے جیسا کہ جبرائیل حضور پاک کے ساتھ جبروت تک گئے تھے۔ایسے لوگوں کو قبر میں بھی دفنا آتے ہیں مگر اُنہیں خبر نہیں ہوتی ایسا مراقبہ اصحابِ کہف کو لگا تھا جو تین سو(۳۰۰) سال سے زائد عرصہ غار میں سوتے رہے۔",
      "ایسا مراقبہ جب غوث پاک کو جنگل میں لگتا تو وہاں کے مکین ڈاکو،آپ کو مردہ سمجھ کر قبر میں دفنانے کیلئے لے جاتے تھے لیکن دفنانے سے پہلے ہی وہ مراقبہ ٹوٹ جاتا۔",
      "اللہ کی طرف سے خاص الہام اور وحی کی پہچان:",
      "جب انسان سینے کی مخلوقوں کو بیدار اور منور کرکے تجلیات کے قابل ہوجاتا ہے تو اُس وقت اللہ اُس سے ہمکلام ہوتا ہے۔یوں تو وہ قادر ِ مطلق ہے کسی بھی ذریعے انسان سے مخاطب ہوسکتا ہے لیکن اُس نے اپنی پہچان کیلئے ایک خاص طریقہ بنایا ہوا ہے تا کہ اُس کے دوست شیطان کے دھوکے سے بچ سکیں۔",
      "سب سے پہلے سریانی زبان میں عبارت سالک کے دِل پر آتی ہے اور اُس کا ترجمہ بھی اُسی زبان میں نظر آتا ہے جس کا وہ حامل ہے .وہ تحریر سفید اور چمکدار ہوتی ہے اور آنکھیں خود بخود بند ہوکر اُسے دیکھتی ہیں۔",
      "پھر وہ تحریر قلب سے ہوتی ہوئی لطیفہ سری کی طرف آتی ہے جس کی وجہ سے زیادہ چمکنا شروع ہوجاتی ہے .پھر وہ تحریر لطیفہ اخفیٰ کی طرف آتی ہے،اخفیٰ سے اور چمک حاصل کر کے زبان پر چلی جاتی ہے اور زبان بے ساختہ وہ تحریر پڑھنا شروع کردیتی ہے .",
      "اگر یہ الہام شیطان کی طرف سے ہو تو منور دِل اُس تحریر کو مدھم کردیتا ہے، اگر تحریر زور آور ہے تو لطیفہ سری یا اخفیٰ اُس تحریر کو ختم کردیتے ہیں۔بالفرض اگر لطیفوں کی کمزوری کی وجہ سے وہ تحریر زبان پر پہنچ بھی جائے تو زبان اُسے بولنے سے روک لیتی ہے۔",
      "یہ الہام خاص ولیوں کیلئے ہوتا ہے جبکہ عام ولیوں کو اللہ تعالیٰ فرشتوں یا ارواح کے ذریعے پیغام پہنچاتا ہے .اور جب خاص الہام کی تحریر کے ساتھ جبرائیل بھی آجائیں تواُسے وحی کہتے ہیں جو صرف نبیوں کیلئےخصوص ہے۔"
    ]
  },
  "the-number-of-souls-created-in-the-heaven-exceeded-the-limit": {
    "title": "آسمان پر روحیں حد سے زیادہ بن گئی تھیں:",
    "sentences": [
      "آسمان پر روحیں حد سے زیادہ بن گئی تھیں:",
      "مقرب روحیں اگلی صفوں میں تھیں۔عام روحوں کو اس دنیا میں بنائے ہوئے آدموں کی قوموں میں بھیجا۔جو کوئی کالی، کوئی سفید، کوئی پیلی اور کوئی لال مٹی سے بنائے گئے تھے۔انہیں جبرائیل اور ہاروت ماروت کے ذریعے علم سکھایا گیا۔جب زمین پر مٹی سے آدم بنائے جاتے، خبیث جِن بھی موقع پا کر اُنکے اور اُنکی اولاد کے جسموں میں داخل ہوجاتے اور انہیں اپنی شیطانی گرفت میں لینے کی کوشش کرتے۔پھر اُنکی قوم کے نبی، ولی اور اُن کی سِکھائی ہوئی تعلیمات چھٹکارے کا ذریعہ بنتی بے شمار آدم جوڑوں کی شکل میں بنائے گئے جن سے اولاد کا سلسلہ جاری ہوا لیکن کئی بار صرف اکیلی عورت کو بنایا گیا اور \"امرِ کُن\" سے اس کی اولاد ہوئی۔وہ قومیں بھی اس دنیا میں موجود ہیں۔اس قبیلے میں صرف عورتیں ہی سردار ہوتی ہیں اور وہ موئنّث کی اولاد ہونے کی وجہ سے رب کو بھی موئنّث سمجھتے ہیں اور خود کو فرشتوں کی اولاد تصور کرتے ہیں، چونکہ اُنکے موئنّث آدم کی شادی’ یا مرد کے‘ بغیر ہی بچے ہوئے تھے۔یہی رسم اُن میں اب بھی چلی آرہی ہے۔ان قبیلوں میں پہلے عورت کے کسی سے بھی بچے ہوجاتے ہیں اور بعد میں کسی سے بھی شادی ہوجاتی ہے اور وہ اس کو معیوب نہیں سمجھتے۔روحوں کے اقرار، قسمت، اور مراتب کی وجہ سے ان ہی جیسے آدم بناکر اُن ہی جیسی روحوں کو نیچے بھیجا گیا۔یہی وجہ ہے کہ ان کیلئے کوئی خاص دین ترتیب نہیں دیا",
      "روز ِ ازل والی جہنمی روح غیر مذہب کے گھر پیدا ہوجائیں۔اُسے کافر اور کاذب کہتے ہیں۔یہی لوگ منکر ِخدا، دُشمنِ انبیاء اور دُشمنِ اولیاء ہوتے ہیں۔متکبر، سخت دِل اور مخلوق ِخدا کو آزار پہنچا کرخوش ہوتے ہیں۔دوسرا درجہ مذہب میں آکر بھی مذہب سے دور ہوتا ہے۔یہی روح اگر کسی مذہبی دیندار گھرانے میں پیدا ہوجائے تو اُسے منافق کہتے ہیں۔",
      "یہی لوگ گستاخ انبیاء، جلیس اولیاء اور مذاہب میں فتنہ ہوتے ہیں۔اِنکی عبادت بھی ابلیس کی طرح بیکار ہوتی ہے۔اِنہیں مذہب جنت میں لے جانے کی کوشش کرتا ہے لیکن مقدر دوزخ کی طرف کھینچتا ہے۔چونکہ نبیوں، ولیوں کی امداد سے محروم ہوتے ہیں اسلئے شیطان اور نفس کے بہکاوے میں آجاتے ہیں کہ تُو اتنا علم جانتا ہے اور اتنی عبادت کرتا ہے تجھ میں اور نبیوں میں کیا فرق ہے؟پھر وہ اپنا باطن دیکھے بغیرخود کو نبی جیسا سمجھنا شروع ہوجاتے ہیں اور ولیوں کو اپنا محتاج سمجھتے ہیں۔پھر روحانیت اور کرامتوں کے اقراری نہیں ہوتے بلکہ اُسی عمل کے اقراری ہوتے ہیں جنکی اُن میں خود کی صلاحیت ہوتی ہے،حتیٰ کہ معجزوں کو بھی جادو کہہ کر جھٹلادیتے ہیں۔ابلیس کی طاقت کو مان لیتے ہیں لیکن انبیا ء و اولیا ء کی طاقت کو مان لینا اِن کیلئے مشکل ہے۔",
      "ازل والی بہشتی روح اگر غیر مذہب یا گندے ماحول میں آجائے تو اُسے معذور کہتے"
    ]
  },
  "the-religion-of-god": {
    "title": "دین ِ الٰہی",
    "sentences": [
      "دین ِ الٰہی",
      "تمام دین اس دنیا میں نبیوں کے ذریعے بنائے گئے۔جبکہ اس سے پہلے خود عشق، خود عاشق، خود معشوق تھا۔اور وہ روحیں جو اس کے قرب، جلوے اور محبت میں تھیں وہی عشق الٰہی، دین الٰہی اور دین ِحنیف تھا۔پھر اُن ہی روحوں نے دنیا میں آکر اُس کو پانے کیلئے اپنا تن من قربان کردیا۔یہ پہلے خاص تک تھا، اب روحانیت کے ذریعے عام تک بھی پہنچ گیا۔",
      "حدیث:حضرت ابو ہریرہ:مجھے حضور پاک سے دو علم حاصل ہوئے ایک تمہیں بتا دیا، دوسرا بتاؤں تو تم مجھے قتل کردو!جب پانی کے حوض سے خشک کتابیں نکلیں تو مولانا روم نے کہا:ایں چیست؟شاہ شمس نے کہا: \"ایں آں علم است کہ تو نمی دانی۔\"جب موسیٰ نے کہا کہ کیا کچھ اور علم بھی ہے؟تو اللہ نے کہا کہ خضر کے پاس چلا جا!ہر نمازی کی دُعا:\"اے اللہ مجھے اُن لوگوں کا سیدھا راستہ دکھا جن پر تیرا انعام ہوا!\"علامہ اقبالؒ: اس کو کیا جانے بچارے دو رکعت کے امام!",
      "وہ روحیں جو ازل سے ہی بامرتبہ ہیں۔اللہ جن سے محبت کرتا ہے اور جو اللہ سے محبت کرتی ہیں۔دنیا میں آکر بھی رب کی نام لیوا ہوئیں،مثلاً عیسیؑ زچگی میں ہی بول اُٹھے تھے کہ میں نبی ہوں جبکہ حضرت مریم کو پیدائش سے پہلے ہی"
    ]
  },
  "the-friend-of-god": {
    "title": "اللہ کا دوست",
    "sentences": [
      "اللہ کا دوست",
      "اگر کسی کو خلق ِ خدا کشف و کرامات اور فیض کی وجہ سے ولی مانتی ہے لیکن اُس کے کسی فعل یا مذہب کی وجہ سے تُو دلبرداشتہ ہے۔اُس کی برائی کرنے سے بہتر ہے تُو ادھر جاناچھوڑ دے۔کیا خبر!وہ کوئی منظور ِ خدا ہو!شیخ بقا ہو!یا کوئی لعل شہباز ہو!کوئی خضر ہو!یا ساھے بابا ہو!یا گرو نانک ہو!کوئی بلھے شاہ ہو، اور کوئی سدا سہاگن بھی ہوسکتا ہے!"
    ]
  },
  "his-divine-eminence-gohar-shahis-revolutionary-message-to-humankind": {
    "title": "گوہرشاہی کا عالمِ انسانیت کے لئے انقلابی پیغام",
    "sentences": [
      "مسلم کہتا ہے کہ:’’ میں سب سے اعلیٰ ہوں‘‘، جبکہ یہودی کہتا ہے:’’ میرا مقام مسلم سے بھی اُونچا ہے‘‘، اور عیسائی کہتا ہے:’’ میں ان دونوں سے بلکہ سب مذاهب والوں سے بلند ہوں کیونکہ میں اللہ کے بیٹے کی امت ہوں۔‘‘لیکن گوہر شاہی کہتا ہے:’’سب سے بہتر اور بلند وہی ہے جس کے دِل میں اللہ کی محبت ہے خواہ وہ کسی بھی مذہب سے نہ ہو!زبان سے ذکر و صلوۃ اُس کی اطاعت اور فرمانبرداری کا ثبوت ہے جبکہ قلبی ذکر، اللہ کی محبت اور رابطے کا وسیلہ ہے۔‘‘",
      "بامرتبہ تصدیق نقالیہ زندیق، جھوٹی نبوت کا دعویدار کافر ہے۔جبکہ جھوٹی ولائت کا دعویدار کفر کے قریب ہے۔ولی دوست کو کہتے ہیں اور دوست کا ایک دوسرے کو دیکھنا اور ہمکلام ہونا ضروری ہے۔حضور نے بھی ایک مرتبہ اصحابہ کو کہا تھا کہ کچھ کام صرف میرے کرنے کے ہیں،تمہارے لئے نہیں ہیں۔ہر نمازی کی دُعا ہوتی ہے کہ :’’اے اللہ مجھے اُن لوگوں کا سیدھا راستہ دیکھا جن پر تیرا انعام ہواُ۔جب تک اُس کی روح بَیتُ المعْمور میں جاکر نماز نہ پڑھے جسے حقیقی نماز کہتے ہیں کیونکہ وہ نماز مرنے کے بعد بھی جاری رہتی ہے۔جیسا کہ شب معراج میں بیت المقدس میں بھی سب نبیوں کی ارواح نے نماز پڑھی تھی، اور جب تک رب کا دیدار نہ ہوجائے اُس وقت تک شریعت کی اتباع ضروری ہے۔البتہ سُست اور گناہ",
      "وتے ہو، روز کریم لگاتے اور خط بناتے ہو اور جسے رب نے دیکھنا ہے کیا تُو نے کبھی اُسے بھی دھویا ہے؟",
      "حدیث:ہر چیز کو دھونے کیلئے کوئی نہ کوئی آلہ ہے جبکہ دِلوں کو دھونے کیلئے اللہ کا ذکر ہے۔",
      "پاکیزہ محبت کا تعلق بھی دِل سے ہوتا ہے زبان سےI Love You کہنے والے مکار ہوتے ہیں۔محبت کی نہیں جاتی…ہوجاتی ہے، جو بھی دِل میں اُتر جائے۔رب کو دِل میں اُتارنے کیلئے تصور، قلبی ذکر اور ولی اللہ ہوتے ہیں۔",
      "صرف گاڑی کا انجن منزل مقصود تک نہیں پہنچا سکتا جب تک دوسری چیزیں بھی یعنی اسٹیرنگ، ٹائر وغیرہ نہ ہوں۔اِسی طرح نماز بھی تزکیہ ِنفس اور تصفیہ قلب کے بغیر ادھوری ہے۔اگر اِن لوازمات کے بغیر نماز ہی سب کچھ …اور جنت ہے پھر تم دوسروں کو کافر، مرتد اور دوزخی کیوں کہتے ہو جبکہ وہ بھی نماز پڑھتے ہیں۔فرق یہ ہی ہے کوئی عیسیٰ کے گدھے پر سوار ہے اور کوئی دجال کے گدھے پر سوار ہے یعنی اندر سے دونوں کالے۔صرف عقیدوں کا فرق ہوا جبکہ عقیدے اِدھر رہ جائینگے، اندر کی روحیں آگے جائینگی۔",
      "زبان میں نماز لیکن دِل میں خرافات، حرص و حسد، یہ نمازِصورت کہلاتی ہے۔عام لوگ اِسی سے خوش فہمی میں مبتلا رہتے ہیں اور فرقہ بندی کا شکار ہوتے رہتے ہیں۔اِن کی دین میں تبلیغ فتنہ بن جاتی ہے۔فرض کیا تم دس پ"
    ]
  },
  "imam-mehdi-will-rejuvenate-all-the-religions": {
    "title": "امام مہدی تمام مذاہب کی تجدید کرینگے",
    "sentences": [
      "امام مہدی تمام مذاہب کی تجدید کرینگے",
      "جس طرح حضور پاکؐ کی ختم نبوت کے بعد مسلم میں مجدد آتے رہے اور ماحول کے مطابق دین میں کچھ تجدید کرتے رہے اسی طرح امام مہدی علیہ السلام کے آنے کے بعد اُن (مجددؤں) کی تجدید ختم ہوجائیگی اور سب مذاهب کے مطابق امام مہدی کی اپنی تجدید ہوگی۔کچھ کتابوں میں ہے وہ ایک نیا دین بنائیں گے۔"
    ]
  },
  "introduction-to-the-person-of-his-divine-eminence-ra-gohar-shahi": {
    "title": "حضرت ریاض احمد گوہرشاہی کا شخصی تعارف",
    "sentences": [
      "حضرت ریاض احمد گوہرشاہی کا شخصی تعارف",
      "25نومبر1941کو برصغیر کے ایک چھوٹے سے گاؤں ڈھوک گوہر شاہ، ضلع راولپنڈی میں پیدا ہوئے۔آپ کی والدہ ماجدہ فاطمی ہیں۔یعنی سادات خاندان سیّد گوہر علی شاہ کے پوتوں میں سے ہیں جبکہ والد گرامی سیّد گوہر علی شاہ کے نواسوں میں سے ہیں اور دادا مُغلیہ خاندان سے تعلق رکھتے ہیں۔بچپن سے ہی آپ کا رُخ اولیاء اکرام کے درباروں کی طرف تھا۔آپ کے والد گرامی فرماتے ہیں کہ گوہر شاہی پانچ یا چھ سال کی عمر سے ہی غائب ہوجاتے اور ہم جب اُنکو ڈھونڈنے نکلتے تو اِن کو نظام الدینؒ اولیاء(نئی دہلی) کے مزار پر بیٹھا ہوا پاتے۔مجھے کئی دفعہ ایسا محسوس ہوا کہ جیسے یہ نظام الدین اولیاء سے باتیں کر رہے ہیں۔یہ اُس وقت کا واقعہ ہے جب حضرت گوہر شاہی کے والد گرامی ملازمت کے سلسلے میں دہلی میں مقیم تھے۔مارچ1997 میں جب گوہر شاہی انڈیا تشریف لے گئے تو نظام الدینؒ اولیاء دربار کے سجادہ نشین اسلام الدین نظامی نے نظام الدین اولیاء کے اشارے پر اِن کو دربار کے سرہانے دستار پہنائی تھی۔",
      "بچپن سے ہی جو بات کہتے وہ پوری ہوجاتی، اس وجہ سے میں ان کی ہر جائز ضد کو پورا کرتا۔آپ کے والد گرامی مزید فرماتے ہیں کہ:’’گوہر شاہی حسب ِمعمول روزانہ صبح لان {Lawn} میں آتے ہیں تو میں اِن کی آمد پر احترام میں",
      "اس کو لائو‘‘، دیکھتا ہوں کہ ماموں کو دو آدمی پکڑ کر لا رہے ہیں اور اشارہ کرتے ہیں کہ یہ ہے۔پھر آواز آتی ہے کہ:’’اس کو گُرزوں سے مارو‘‘ ، تب اس کو مارتے ہیں۔تو وہ چیخیں مارتا اور دھاڑتا ہے اور چیختے چیختے اس کی شکل سور کی طرح بن جاتی ہے .پھر آواز آتی ہے کہ :’’ تو بھی اس کے ساتھ اگر شامل ہوا تو تیرا بھی یہی حال ہو گا‘‘۔پھر میں توبہ توبہ کرتا ہوں اور آنکھ کھلتی ہے تو زبان پر یہی ہوتا ہے کہ: ’’ یا رب میری توبہ، یا رب میری توبہ‘‘ اور کئی سال تک اس خواب کا اثر رہا۔",
      "اس کے دوسرے دن میں گائوں کی طرف جا رہا تھا، بس میں سوار تھا راستے میں دیکھا کچھ ڈاکو ایک ٹیکسی سے ٹیپ ریکارڈر نکالنے کی کوشش کر رہے تھے۔ڈرائیور نے مزاحمت کی تو اس پر چھریوں سے وار کر کے قتل کر دیا۔یہ منظر دیکھ کر ہماری بس وہاں رک گئی اور وہ ڈاکو ہمیں دیکھ کر فرار ہو گئے اور ڈرائیور نے تڑپ کر ہمارے سامنے جان دے دی، پھر ذہن میں یہی آیا کہ زندگی کا کیا بھروسہ، رات کو سونے لگاتو اندر سے یہ شعر گونجناشروع ہو گئے،",
      "کر ساری خطائیں معاف میری … تیرے در پہ میں آن گرا",
      "اور ساری رات گریہ زاری میں گزری، اس واقعہ کے کچھ عرصہ بعد میں دنیا چھوڑ کرجام داتارؒ کے دربار پر چلا گیا، لیکن وہاں سے بھی کوئی منزل نہ ملی اور میرا بہ"
    ]
  },
  "miraculous-images-of-his-divine-eminence-ra-gohar-shahi": {
    "title": "منجانب اللہ تصاویرِ گوہر شاہی کا ظہور",
    "sentences": [
      "منجانب اللہ تصاویرِ گوہر شاہی کا ظہور",
      "چاند(moon)",
      "سورج(sun)",
      "خلاء(space)",
      "حجر اسود(black-stone)",
      "نبیولا(nebula)",
      "مریخ(mars)"
    ]
  }
};}}
