if (typeof window.PRELOADED_TEXTS === 'undefined') { window.PRELOADED_TEXTS = {}; }

window.PRELOADED_TEXTS["some-selected-features-of-his-divine-eminence-ra-gohar-shahis-esoteric-personality"] = {
  "title": "حضرت گوہرشاہی کی باطنی شخصیت کے چند حقائق",
  "sentences": [
    "19سال کی عمر میں جسۂ توفیق  ِ الٰہی ساتھ لگا دیا گیا تھا جو ایک سال رہااور اُس کے اثر سے کپڑے پھاڑ کر صرف ایک دھوتی میں جام داتارؒ کے جنگل میں چلے گئے تھے۔",
    "جسۂ توفیق  ِالٰہی عارضی طور پر ملا تھا، جو کہ 14 سال غائب رہا اور پھر 1975 میں دوبارہ سیون شریف کے جنگل میں لانے کا سبب بھی یہی جسۂ توفیق  ِالٰہی ہی تھا۔",
    "25 سال کی عمر میں جسۂ گوہر شاہی کو باطنی لشکر کے سالار کی حیثیت سے نوازا گیا، جس کی وجہ سے ابلیسی لشکر اور دنیاوی شیطانوں کے شر سے محفوظ رہے۔",
    "جسۂ توفیق  ِالٰہی اور طفلِ نوری ، ارواح ، ملائکہ اور لطائف سے بھی اعلیٰ (Special) مخلوقیں ہیں،",
    "ان کا تعلق ملائکہ کی طرح براہ ِراست رب سے ہے اور ان کا مقام ، مقامِ احدیت ہے۔",
    "35 سال کی عمر میں 15 رمضان 1976 کو ایک نطفۂ نور قلب میں داخل کیا گیا،",
    "کچھ عرصہ بعدتعلیم و تربیت کے لئے کئی مختلف مقامات پر بلایا گیا۔ 15 رمضان 1985 میں جبکہ آپ دنیاوی ڈیوٹی پر حیدرآباد مامور ہوچکے تھے، وہی نطفۂ نور طفلِ نوری کی حیثیت پا کر مکمل طور پر جلوہ گر ہو گیا۔"
  ]
};

window.PRELOADED_TEXTS["space"] = {
  "title": "خلاء",
  "sentences": [
    "خلاء",
    "اٹلانٹا کے خلاباز آئزک ہاکنگز نے کہا کہ یہ واضح طور پر کسی انسان کے چہرے کا عکس ہے۔ یہ اپنی مرضی سے ظاہر اور غائب ہونے کی صلاحیت رکھتا ہے، ناسا میں موجود ہر ایک نے یہ محسوس کیا کہ یہ بہت بڑی خلائی دریافت ہے۔ ہو سکتا ہے کہ یہ چہرہ کئی سالوں سے ہمیں دیکھ رہا ہو۔ ہاکنگز نے مزید کہا کہ ہمارے ذہنوں سے یہ خیال بھی گزرا ہے کہ شاید یہ خدا کا چہرہ ہو، اور کہیں بھی اِس کی تردید نہیں ہے۔",
    "حضرت گوہر شاہی",
    "حضرت گوہر شاہی کا یہ عکسِ مبارک دراصل وہ باطنی مخلوق  ”طفلِ نوری“ ہے، جو چند خاص اولیاء کیلئے مخصوص ہے اور جس کا تذکرہ اولیائے عظام کی مختلف کتابوں میں درج ہے"
  ]
};

window.PRELOADED_TEXTS["sun"] = {
  "title": "سورج",
  "sentences": [
    "سورج",
    "سورج کی یہ تصویر ناسا NASA  کی طرف سے ریلیز ہوئی ہے",
    "مزید معلومات کیلئے مندرجہ ذیل ویب سائٹ پر رابطہ کریں",
    "سورج کی تصویر",
    "تصاویرِ حضرت گوہر شاہی مختلف اوقات میں",
    "سورج کی اِن تصاویر کو North کے مطابق گُھما کر دیکھیں",
    "ناسا سے حاصل کردہ سورج کی اِس تصویر میں حضرت گوہر شاہی کا یہ چہرہ بھی بہت واضح نظر آتا ہے۔",
    "چاند سورج کیا گواہی دینگے تیری اے گوہر  ہے ثبوتِ حق تیرا اِس دل میں آجانے کا نام  یونس"
  ]
};

window.PRELOADED_TEXTS["taqdir-(the-fate)"] = {
  "title": "تقدیر",
  "sentences": [
    "تقدیر",
    "تقدیر دو طرح کی ہوتی ہے، ۱-ازل ...... اور ...... ۲۔معلق۔",
    "بعض لوگ کہتے ہیں کہ جب مقدر میں رزق لکھ دیا تو اس کیلئے گھومنا پھرنا کیا؟ مدم جینیبیا نے کہا کہ رزق کو حاصل کرنے کیلئے گھومنا پھرنا بھی مقدر میں لکھ دیا۔",
    "مثال کے طور پر جیسا کہ آپ کیلئے پھولوں کا گلدستہ چھت پر رکھ دیا گیا ہے۔",
    "\"یہ تقدیر ازل ہے\"",
    "اِسے حاصل کرنے کیلئے آپ کو سیڑھیوں کے ذریعے چھت پر پہنچنا ہے۔",
    "\"یہ تقدیر معلق ہے\"",
    "جو  آپ کے اختیار میں ہے اور اسی معلق کا حساب کتاب ہوگا ، نہ کہ تقدیر ازل کا! آپ چھت پر پہنچیں گے اور اپنا نصیب حاصل کرلینگے۔اگر آپ نے سستی کی اور چھت تک نہ پہنچے تو اس سے محروم ہوجائیں گے۔ دوسرا شخص جس کے مقدر میں چھت پر گلدستہ نہیں ہے وہ اگرسیڑھیوں کے ذریعے یا سخت محنت سے بھی چھت پر پہنچ جائے تو وہ محروم ہی ہے۔"
  ]
};

window.PRELOADED_TEXTS["the-doctrine-of-nafs-(the-self)"] = {
  "title": "تذکرۂ نفس",
  "sentences": [
    "تذکرۂ نفس",
    "یہ شیطانی جرثومہ ہے .ناف میں اس کا ٹھکانہ ہے .سب نبیوں ولیوں نے اس کی شرارت سے پناہ مانگی ، اس کی غذا فاسفورس اور بدبو ہے، جو ہڈیوں، کوئلے اور گوبر میں بھی ہوتی ہے َہر مذہب نے جنابت کے بعد نہانے پر زور دیا ہے۔ کیونکہ جنابت کی بدبو مساموں سے بھی خارج ہوتی ہے۔ بد بودار قسم کے مشروب اور بد بو دار قسم کے جانوروں کے گوشت کو بھی ممنوع قرار دیاہے . روز ازل میں اللہ کے سامنے والی تمام روحیں، جمادی تک، ایک دوسرے سے مانوس اور متحد ہوگئیں۔روح جمادی کی وجہ سے انسان نے پتھروں کے مکان بنائے اور روح نباتی کی وجہ سے درختوں کی لکڑیوں سے چھت بنائے .درختوں کے سائے سے بھی مستفیض ہوئے، درختوں نے ان کو صاف سُتھری آکسیجن پہنچائی۔پیچھے والی حیوانی روحیں جو دنیا میں آکر جانور بن گئے، سب انسانوں کیلئے حلال کردیئے گئے۔جبکہ ان ہی سے متعلقہ پرندے بھی حلال کردئیے گئے .بائیں طرف جنات اور سفلی مؤکلات بنے پھر اُن سے پیچھے کی طرف خبیث ارواح جو آخر میں دشمن خدا ہوئیں۔اور وہ حیوانی، نباتی اور جمادی روحیں جو خبیثوں کے پیچھے نمودار ہوئیں تھیں انہوں نے انسانوں سے دشمنی کری ، ان کی روح جمادی کے دنیا میں آنے سے راکھ کوئلہ بنی، جس کی گیس انسانوں کے لئے نقصان دہ تھی۔",
    "اُن کی ن کا خادم، پیغام رساں اور مددگار بنادیا اور انسان کو سب سے زیادہ فضیلت عطا کرکے اپنا خلیفہ مقرر کردیا۔اب انسان کی مرضی، محنت اور قسمت ہے کہ خلافت منظور کرے یا ٹھکرا دے۔ نفس خواب میں جسم سے باہر نکل جاتا ہے اور اس بندے کی شکل میں جنات کی شیطانی محفلوں میں گھومتا ہے۔ نفس کے ساتھ خناس بھی ہوتا ہے جس کی شکل ہاتھی کی طرح ہوتی ہے اور یہ نفس اور قلب کے درمیان بیٹھ جاتا ہے، انسان کو گمراہ کرنے کیلئے نفس کی مدد کرتا ہے۔ اس کے علاوہ چار پرندے بھی انسان کو گمراہ کرنے کیلئے چاروں لطائف کے ساتھ چمٹ جاتے ہیں، جیسا کہ قلب کے ساتھ مرغ، جس کی وجہ سے دل پر شہوت کا غلبہ رہتا ہے، قلب کے ذکر سے وہ مرغ، مرغ ِ بسمل بن جاتا ہے اور حرام وحلال کی تمیز کا شعور پیدا کردیتا ہے۔پھر اس قلب کو قلب ِ سلیم کہتے ہیں۔ سری کے ساتھ کوا،کوے کی وجہ سے حرص، اور خفی کے ساتھ مور، مور کی وجہ سے حسد، اور اخفیٰ کے ساتھ کبوتر، کبوتر کی وجہ سے بُخل آجاتا ہے اور اُن کی خصلتیں لطائف کو حرص و حسد پر مجبور کردیتی ہیں جب تک لطائف منور نہ ہوجائیں۔ابراہیم ؑ کے جسم سے ان ہی چار پرندوں کو نکال کر، پاکیزہ کرکے دوبارہ جسم میں ڈالا گیا تھا۔مرنے کے بعد پاکیزہ لوگوں کے یہ پرندے درختوں پر بسیرا بنالیتے ہیں۔بہت سے لوگ جنگلوں میں کچھ دن رہ کر پرندوں جیسی آوازیں نکالتے ہیں، اور یہ پرندے ان سے مانوس ہوجاتے ہیں اور اُن کے تابع ہو جاتے ہیں"
  ]
};

window.PRELOADED_TEXTS["the-excerpts-from-the-book-for-quick-awareness"] = {
  "title": "کتاب کی روشناس کے لئے چند اقتباس",
  "sentences": [
    "کتاب کی روشناس کے لئے چند اقتباس",
    "1. اگر آپ کسی مذہب میں ہیں لیکن اللہ کی محبت سے محروم ہیں، ان سے وہ بہتر ہیں جو کسی مذہب میں نہیں لیکن اللہ کی محبت رکھتے ہیں۔",
    "2. محبت کا تعلق دل سے ہے، جب دل کی دھڑکن کے ساتھ اللہ اللہ ملایا جاتا ہے، تو وہ خون کے ذریعے نس نس میں پہنچ کر روحوں کو جگاتا ہے۔پھر روحیں اللہ کے نام سے سرشار ہو کر اللہ کی محبت میں چلی جاتی ہیں۔",
    "3. رب کا کوئی بھی نام خوا ہ کسی بھی زبان میں ہو قابلِ تعظیم ہے لیکن رب کا اصلی نام سُریانی زبان میں اللہ ہے جوکہ عرشیوں کی زبان ہے، اسی نام سے فرشتے اُسے پکارتے ہیں اور ہر نبی کے کلمے کے ساتھ منسلک ہے۔",
    "4. جو بھی شخص سچے دل سے رب کی تلاش میں بحر و بر میں ہے وہ بھی قابلِ تعظیم ہے۔",
    "5. اس دنیا میں ایک ہی وقت میں علیحدہ علیحدہ خطوں میں کئی آدم آئے۔ تمام آدم دنیا میں دنیا کی ہی مٹی سے بنائے گئے، جبکہ آخری آدم جو عرب میں دفن ہیں بہشت کی مٹی سے واحد بنائے گئے، ان کے سوا کسی اور آدم کو فرشتوں نے سجدہ نہیں کیا۔ابلیس اسی آدم کی اولاد کا دشمن ہوا۔",
    "6. انسان کے جسم میں سات قسم کی مخلوقیں ہیں، جن کا تعلق علیحدہ علیحدہ آسمانوں، علیحدہ علیحدہ بہشتوں اور انسان کے جسم میں علیحدہ علیحدہ  کاموں سے ہے۔ اگر ان کو نور کی طاقت پہنچائی جائے تو یہ اُس انسان کی صورت میں ایک ہی وقت میں کئی جگہ حتیٰ کہ ولیوں، نبیوں کی مجلس اور رب سے ہمکلام یا دیدار تک پہنچ سکتی ہیں۔",
    "7. ہر انسان کے دو مذہب ہوتے ہیں، ایک جسم کا مذہب جو مرنے کے بعد ختم ہو جاتا ہے، دوسراارواح کا مذہب جو کہ روزِ ازل میں تھا یعنی اللہ سے محبت، اسی کے ذریعے انسان کا مرتبہ بلند ہوتا ہے۔",
    "8.  سب مذاہب سے بالاتر رب کا عشق ہے، اور سب عبادات سے بالاتر رب کا دیدار ہے۔",
    "9. انسان، حیوانوں، درختوں اور پتھروں کے متعلق معلومات، کہ یہ کس طرح وجود میں آئے اور کیوں کوئی حرام اور کوئی حلال ہوا۔",
    "10. ارواح اور فرشتوں کے امرِ کُن سے بھی پہلے کون سے مقامات اور باطنی اسرار موجود تھے"
  ]
};

window.PRELOADED_TEXTS["the-friend-of-god"] = {
  "title": "اللہ کا دوست",
  "sentences": [
    "اللہ کا دوست",
    "اگر کسی کو خلق ِ خدا کشف و کرامات اور فیض کی وجہ سے ولی مانتی ہے لیکن اُس کے کسی فعل یا مذہب کی وجہ سے تُو دلبرداشتہ ہے۔ اُس کی برائی کرنے سے بہتر ہے تُو ادھر جاناچھوڑ دے۔  کیا خبر! وہ کوئی منظور ِ خدا ہو! شیخ بقا ہو!یا کوئی لعل شہباز ہو!کوئی خضر ہو! یا ساھے بابا ہو! یا گرو نانک ہو! کوئی بلھے شاہ ہو، اور کوئی سدا سہاگن بھی ہوسکتا ہے!"
  ]
};

window.PRELOADED_TEXTS["the-goharian-terminology"] = {
  "title": "The Goharian Terminology",
  "sentences": [
    "یہ صفحہ کتاب کے اردو نسخے میں موجود نہیں ہے۔"
  ]
};

window.PRELOADED_TEXTS["the-heart-has-the-central-and-very-important-role-in-spirituality"] = {
  "title": "تصوف میں اہمیت قلب کو ہے",
  "sentences": [
    "تصوف میں اہمیت قلب کو ہے",
    "کسی نے ضربوں،کسی نے کبڈی، کسی نے ڈانس، کسی نے دیواریں بنائیں اور ڈھائیں اور کسی نے ورزش کے ذریعے دِل کی دھڑکن کو اُبھارا پھر اس کے ساتھ اللہ اللہ ملانے میں آسانی ہوگئی اور بتدریج اللہ اللہ سب لطائف تک خود ہی پہنچ گیا۔اور کچھ لوگ گہرائی میں جائے بغیر انکی نقل کرنے لگے۔ اُنہوں نے بھی اللہ اللہ کے ساتھ ڈانس شروع کردیا۔دھڑکنوں کے ساتھ اللہ اللہ تونہ سمجھ اور نہ ملا سکے البتہ اُنکی روح ِحیوانی جس کا تعلق اُچھل کود سے ہے، اللہ کے نام سے مانوس ہوگئی۔ اسی طرح موسیقی کے ساتھ اللہ اللہ ملانے سے روح ِ نباتی بھی مانوس اور طاقتور ہوتی ہے۔ موسیقی روحِ ِنباتی کی غذا ہے۔ امریکہ میں کچھ فصلوں پر موسیقی کے ذریعے تجربہ کیا گیا۔ایک ہی جیسی فصل ایک ہی جیسی زمین پر اُگائی گئی۔ ایک میں دِن رات موسیقی اور دوسری کو خاموش رکھا گیا۔جبکہ موسیقی والی فصل دوسری سے نشوونما میں بہت بہترہوئی۔",
    "نفس بہت موذی ہے۔ پاک ہونے کے بعد بھی بہانے خور ہے۔جبکہ اس کی پسند سازوآواز ہے۔ کچھ لوگوں نے ساز کے ذریعے نفس کو متوجہ کرکے اُس کا رُخ اللہ کی طرف موڑنے کی کوشش کری۔ کچھ لوگوں نے گٹار کے ساتھ اللہ اللہ ملایا اور نہ سہی کم از کم کان کی عبادت تک پہنچ گئے۔ مجھے ایک گٹار والے نے قصّہ سنایا تھا کہ میں شوقیہ فارغ وقت گٹار کی تار کے ساتھ اللہ اللہ ملاتا رہتا ہوں۔ کبھی کبھی جب نیند سے بیدار ہوتا ہوں تو میرے اندر سے اُسی طرح اللہ اللہ کی آواز آرہی ہوتی ہے۔ ایسے لوگ دوسرے اشغال یعنی گانے بجانے والوں اور تماشائیوں سے بہتر ہوگئے۔لیکن کسی ولائت کے مرتبہ تک نہ پہنچ سکے۔یہ لگن، تڑپ اور تلاش والے لوگ ہوتے ہیں اور کسی کامل کے ذریعے کسی منزل تک پہنچ جاتے ہیں۔اسلام میں بھی اور دوسرے مذاہب کے صوفیوں نے بھی کسی نہ کسی طریقہ سے رب کے نام کو اپنے اندر جذب کرنے کی کوشش کیا۔جو فعل رب کی طرف موڑے اور اُس کے عشق میں اضافہ کرے وہ ناجائز نہیں ہے۔",
    "حدیث: \"اللہ عملوں کو نہیں بلکہ نیتوں کو دیکھتا ہے۔\" "
  ]
};

window.PRELOADED_TEXTS["the-human-soul"] = {
  "title": "انسانی روح",
  "sentences": [
    "انسانی روح",
    "اِس کی نبوت اور علم ابراہیم ؑ کو ملا تھا",
    "یہ دائیں پستان کے قریب ہوتی ہے۔ ذکر کی ضربوں اور تصور سے اس کو بھی جگایا جاتا ہے۔پھر اِدھر بھی ایک دھڑکن نمایاں ہوجاتی ہے۔ اس کے ساتھ( ذکر) یااللہ ملایا جاتا ہے پھر انسان کے اندر دو بندے ذکر کرنا شروع کردیتے ہیں اور اس کا مرتبہ قلب والے سے بڑھ جاتا ہے۔ روح کا رنگ سُرخی مائل ہوتا ہے اور اس کی بیداری سے جبروت تک (جو مقام ِ جبرائیل ہے) رسائی ہوجاتی ہے۔ غضب و غصّہ اس کے ہمسایہ ہوتے ہیں جو جل کر جلال بن جاتے ہیں۔"
  ]
};

window.PRELOADED_TEXTS["the-method-of-producing-divine-light"] = {
  "title": "نور بنانے کا طریقہ",
  "sentences": [
    "نور بنانے کا طریقہ",
    "پرانے زمانے میں پتھروں کی رگڑ سے آگ حاصل کی جاتی تھی جبکہ لوہے کی رگڑ سے भी چنگاری اُٹھتی ہے۔ پانی سے پانی ٹکرایا تو بجلی بن گئی۔ اِسی طرح انسان کے اندر خون کے ٹکراؤ یعنی دِل کی ٹک ٹک سے بھی بجلی بنتی ہے۔ہر انسان کے جسم میں تقریباً ڈیڑھ والٹ بجلی موجود ہے۔جس کے ذریعے اس میں پھرتی ہوتی ہے۔بڑھاپے میں ٹک ٹک کی رفتار سُست ہونے کی وجہ سے بجلی میں بھی اور چستی میں بھی کمی آجاتی ہے۔سب سے پہلے دِل کی دھڑکنوں کو نمایاں کرنا پڑتا ہے۔ کوئی ڈانس کے ذریعے، کوئی کبڈی یا ورزش کے ذریعے، اور کوئی اللہ اللہ کی ضربوں کے ذریعے یہ عمل کرتے ہیں۔جب دِل کی دھڑکنوں میں تیزی آجاتی ہے پھر ہر دھڑکن کے ساتھ اللہ اللہ، یا ایک کے ساتھ اللہ اور دوسری کے ساتھ’’ ھو‘‘ ملائیں۔ کبھی کبھی دِل پر ہاتھ رکھیں، دھڑکنیں محسوس ہوں تو اللہ ملائیں۔کبھی کبھی نبض کی رفتار کے ساتھ ا للہ ملائیں۔تصور کریں کہ اللہ دِل میں جارہا ہے۔اللہ ھو کا ذکر بہتر اور زود اثر ہے۔ اگر کسی کو ’’ ھو ‘‘ پر اعتراض یا خوف ہو تو وہ بجائے محرومی کے دھڑکنوں کے ساتھ اللہ اللہ ہی ملاتے رہیں۔ وِرد و وظائف اور ذکوریت والے لوگ جتنا بھی پاک صاف رہیں ان کیلئے بہتر ہے، کہ بے ادب… بے مراد…… باادب… بامراد…",
    "پہلا طریقہ:",
    "کاغذ پر کالی پنسل سے اللہ لکھیں، جتنی دیر ہو سکے اس کو تکتے رہیں"،
    "کے دوران بطور آزمائش باری باری، اگر مناسب سمجھیں تو سب کا تصور کریں جس کے تصور سے ذکر میں تیزی اور ترقی نظر آئے آپ کا نصیبہ اُسی کے پاس ہے پھر تصور کیلئے اُسی کو چُن لیں کیونکہ ہر ولی کا قدم کسی نہ کسی نبی کے قدم پر ہوتا ہے، بے شک نبی ظاہری حیات میں نہ ہو!  اور ہر مومن کا نصیبہ کسی نہ کسی ولی کے پاس ہوتا ہے۔ ولی کی ظاہری حیات شرط ہے۔ لیکن کبھی کبھی کسی کو مقدر سے کسی ممات والے کامل ذات سے بھی ملکوتی فیض ہوجاتا ہے لیکن ایسا بہت ہی محدود ہے۔ البتہ ممات والے درباروں سے دنیاوی فیض پہنچا سکتے ہیں۔ اِسے اویسی فیض کہتے ہیں اور یہ لوگ اکثر کشف اور خواب میں اُلجھ جاتے ہیں کیونکہ مرشد بھی باطن میں اور ابلیس بھی باطن میں، دونوں کی پہچان مشکل ہوجاتی ہے۔ فیض کے ساتھ علم بھی ضروری  ہوتا ہے جس کیلئے ظاہری مرشد زیادہ مناسب ہے۔ اگر فیض ہے !علم نہیں !تو اُسے مجذوب کہتے ہیں۔ فیض بھی ہے، علم بھی ہے اُسے محبوب کہتے ہیں۔محبوب علم کے ذریعے لوگوں کو دنیاوی فیض کے علاوہ روحانی فیض بھی پہنچاتے ہیں جبکہ مجذوب ڈنڈوں اور گالیوں سے دنیاوی فیض پہنچاتے ہیں۔",
    "اگر کوئی بھی آپ کے تصور میں آکر،آپ کی مدد نہ کرے تو پھر \" گوہر شاہی \" ہی کو آزما کر دیکھیں",
    "مذہب کی قید نہیں! البتہ ازلی بدبخت نہ ہو۔ بہت سے لوگوں کو چاند سے بھی ذکر عطا ہوجاتا ہے۔"
  ]
};
