if (typeof window.PRELOADED_TEXTS === 'undefined') { window.PRELOADED_TEXTS = {}; }

window.PRELOADED_TEXTS["front-cover"] = {
  "title": "سرورق",
  "sentences": [
    "دینِ الٰہی",
    "Deen e Ilahi Urdu Book Front Cover"
  ]
};

window.PRELOADED_TEXTS["declaration-of-the-mursaleen-(the-grand-prophets)"] = {
  "title": "رسولوں کے کلمے یہ ہیں",
  "sentences": [
    "رسولوں کے کلمے یہ ہیں",
    "عیسائیوں کا کلمہ",
    "لاالہٰ الا اللہ عیسیٰ روح اللہ",
    "ترجمہ:اللہ کے سوا کوئی معبود نہیں عیسیٰ اللہ کی روح ہیں",
    "یہودیوں کا کلمہ",
    "لا الہٰ الا اللہ موسیٰ کلیم اللہ",
    "ترجمہ:اللہ کے سوا کوئی معبود نہیں موسیٰ اللہ سے بات چیت کرتے ہیں",
    "ابراھموں کا کلمہ",
    "لا الہٰ الا اللہ ابراھیم خلیل اللہ",
    "ترجمہ:اللہ کے سوا کوئی معبود نہیں ابراھیم اللہ کے دوست ہیں",
    "مسلمانوں کا کلمہ",
    "لا الہٰ الا اللہ محمد رسول اللہ",
    "ترجمہ:اللہ کے سوا کوئی معبود نہیں محمد اللہ کے رسول ہیں",
    "جبکہ ہندو اور سکھ دین  ِ آدم اور دین  ِنوح کی ایک کڑی ہیں۔آدم کی حجر اسود(پتھر) کی تعظیم سے اِن میں بھی پتھر پوجنے کی ریت چل پڑی۔کشتی ِنوح سے بچے ہوئے لوگوں نے بھی ہندوستان میں جاکر تبلیغ کری تھی اور خضر سے بھی اِن کے گروؤں کو فیض ملا تھا، اور اِن کی دعاؤں میں آدم (شنکر جی) اور خضر(وشنو مہاراج) کے نام شامل ہیں۔",
    "ہر مذہب والا خواہ کوئی بھی زبان رکھتا ہو لیکن یہ کلمے اللہ کی سریانی زبان میں اُس کی پہچان اور نجات ہیں.عام انسان کیلئے روزانہ کم از کم [33] مرتبہ اللہ اور رسول کو صبح اور شام یاد کرنا ضروری ہے۔",
    "دنیاوی مصیبتوں سے محفوظ کیلئے روزانہ(99) مرتبہ صبح اور شام یا جتنا بھی ہوسکے، مصیبت کو ٹالنے کیلئے پانچ ہزار(5,000)، پچیس ہزار(25,000)یا بَہتّر ہزار(72,000)کئی آدمی ایک ہی نشست میں بیٹھ کر پڑھ سکتے ہیں۔آخری حد سَوا لاکھ(125,000)ہے۔",
    "دِل کو صاف کرنے اور گناہوں کے دھبّے مٹانے کیلئے سانس کی مشق، سانس لیتے وقت ’لا الہٰ الا اللہ‘ اور سانس نکالتے وقت باقی اگلا حصّہ پڑھیں،سانس نکالتے وقت دھیان دِل کی طرف ہو۔",
    "اللہ سے محبت اور قرب حاصل کرنے کیلئے دوسرا طریقہ ہے جو بغیر رب کی رضا کے مشکل ہے۔کتاب میں درج شدہ طریقے کے مطابق دِل کی دھڑکن کو تسبیح بنانا پڑتا ہے اور دھڑکنوں کے ساتھ صرف اللہ کے خالص الفاظ کو ملانا پڑتا ہے۔",
    "جتنا ہوسکے روزانہ اِس کی بھی مشق کریں۔کسی کا دھیان کے ذریعے، کسی کا بغیر دھیان کے بھی اور کسی کا قلب و روح کی بیداری کے بعد ہر وقت بھی خود بخود ذکر جاری ہوسکتا ہے۔",
    "اللہ کے دوستوں کا ذکر بَہتّر ہزار روزانہ ہوتا ہے جبکہ عاشقوں کا ذکر سَوا لاکھ تک پہنچ جاتا ہے۔اگر لطائف بھی ذکر میں لگ جائیں تو اُسکے ذکوریت کا شمار کراماً کاتبین کے بھی بس میں نہیں رہتا۔",
    "کوئی فرش پر کوئی عرش پر",
    "کوئی کعبے میں کوئی روئے ِخدا",
    "(تریاق قلب)",
    "مذہب والے اسم ِاللہ کے علاوہ نبی کے نام کو بھی دِل میں جمانے کی کوشش کیا کریں تاکہ اسم اللہ کنٹرول میں رہے۔",
    "وجد، جذب یا جلال کی صورت میں نبی کا کلمہ اُس وقت تک پڑھیں جب تک وہ حالت ختم نہ ہو اور دیکھے ہوئے مرشد کو بھی خیال میں لائیں تاکہ اُس کی روحانی طاقت دِل پر اللہ نقش کرے۔",
    "جن کا کوئی مذہب نہیں، خدا خبر اُن کا نصیبہ کس کے پاس ہے یا کہیں بھی نہیں ہے۔وہ باری باری مشق کے دوران پانچوں مرسلین کے نام کا تصور کریں اور جس بھی دیکھے ہوئے ولی پر یقین رکھتے ہیں اُس کا بھی خیال لائیں۔",
    "پھر جس کے آپ ہیں وہ اندر سے بولنا شروع کردے گا یعنی آپ کا رُخ، محبت اور دِل اُسی کی طرف مائل ہوجائیگا۔",
    "کسی زمانے میں اہل ِکتاب ایک پلیٹ فارم پر جمع ہوگئے تھے، آپس میں اکھٹا کھانا پینا اور ایک دوسرے سے شادیوں کی اجازت ہوگئی تھی۔اِسی طرح اِس زمانے میں اہل ِذکر بھی ایک ہوجائینگے۔اہل کتاب والے عارضی تھے کیونکہ کتاب زبان پر تھی…نکل گئی اور یہ مستقل ہونگے کیونکہ اللہ کا نام اور اُس کا نور خون اور دِل میں ہوگا۔جو بیماری خون میں چلی جائے یا جس کی محبت دِل میں اُتر جائے اُس کا نکلنا مشکل ہے۔",
    "پانی پانی ہی ہے لیکن جب رگڑا لگتا ہے تو بجلی بن جاتا ہے۔دودھ کو رگڑتے ہیں تو مکھن بن جاتا ہے۔اسی طرح آسمانی کتابوں کی اصلی آیتوں کا جب تکرار کرتے ہیں تو نور بن جاتا ہے۔آیتوں اور صفاتی اسماء کے تکرار سے صفاتی نور بنتا ہے جس کی پہنچ ملائکہ تک ہے جو بلواسطہ ہے۔یہ وحدت الوجود کا مقام ہے لیکن اللہ کے ذاتی نام کے تکرار کے نور کی پہنچ ذات تک ہے جو بلا واسطہ ہے۔یہ وحدت الشہود سے تعلق رکھتا ہے۔"
  ]
};

window.PRELOADED_TEXTS["des-pardes"] = {
  "title": "لندن سے شائع ہونے والے ہفت روزہ ”دیس پردیس“ میں ہندوئوں کی جانب سے حضرت گوہر شاہی کا تعارف",
  "sentences": [
    "لندن سے شائع ہونے والے ہفت روزہ ”دیس پردیس“ میں ہندوئوں کی جانب سے حضرت گوہر شاہی کا تعارف"
  ]
};

window.PRELOADED_TEXTS["exhaustive-explanation-about-the-images-on-the-sun-and-the-moon"] = {
  "title": "چاند اور سورج پر تصاویر کے بارے میں مکمل وضاحت",
  "sentences": [
    "چاند اور سورج پر تصاویر کے بارے میں مکمل وضاحت",
    "گوہرشاہی روحانی تعلیم اور جگہ جگہ خطابات  کے ذریعہ پوری دنیا میں مشہور اور دلعزیز ہو گئے۔",
    "1994 میں مانچسٹر (انگلینڈ) میں کچھ لوگوں نے چاند پر گوہرشاہی کی تصویر کی نشان دہی کی۔پھر پاکستان اور دوسرے ممالک سے भी شہادتیں وصول ہوئیں، ویڈیو کے ذریعہ چاند کی تصاویریں اُتاری گئیں۔پھر بیرون ممالک اور ناسا سے چاند کی تصویریں منگوائی گئیں، شروع شروع میں تصویریں مدھم تھیں، لیکن گزشتہ دو سال سے اِتنی واضح ہو گئیں کہ دوربین یا کمپوٹر کے بغیر بھی دیکھی جا سکتی ہیں ۔",
    "1996 میں ہمارے نمائندہ ظفر حسین نے ناسا والوں کو نشاندہی کرائی۔اُنہوں نے کہا ہمیں پتا ہے کہ چاند پر چہرہ ہے، یہ چہرہ عیسیٰ کا ہے، جو دو سو میل لمبی روشنی سے معلوم ہوتا ہے۔امریکی شہریوں نے بھی ناسا پر زور دیا کہ اِس تصویر کے بارے میں کچھ وضاحت کی جائے لیکن (گوہر شاہی کا) ایشیائی ہونے کی وجہ سے ناسا خاموش رہا۔بلکہ ناسا کے ہی پروفیسر ماہر فلکیات Dinsmore Alterنے اپنی تصنیف شدہ کتاب (Pictorial Astronomy) میں تصویر کو کچھ رد و بدل کرکے عورت کے روپ میں پیش کیا، اور پوری عیسائی مشنری میں یہ افواہ پھیلا دی کہ چاند پر حضرت مریم کی تصویر ہے۔",
    "جب پاکستان کے اخباروں میں یہ خبر نشر ہوئی تو بہت سے لوگوں نے اِس کی تحقیق کے بعد تصدیق کری، بہت سے لوگوں نے بغیر تحقیق کے تمسخر اُڑایا اور بہت سے لوگوں نے اِسے جادو سمجھا۔کچھ عرصے بعد خلاء میں بھی تصویر کا شور ہوا ۔",
    "لیکن اُس کا اثر ذاکرین(معتقدین گوہرشاہی) کے علاوہ کہیں بھی نہ دِکھا۔",
    "1998 میں پرچم اخبار میں یہ خبر چھپی کہ حجر اسود میں کسی کی شبیہ نظر آ رہی ہے۔ہم اِس شبیہ کے متعلق پہلے ہی معلومات رکھتے تھے۔بلکہ حجر اسود کے کئی تغرے نشان زدہ بھی ہمارے پاس موجود تھے اور تقریباً ہر سرفروش تحقیق کر چکا تھا۔",
    "خاموشی کی وجہ مسلمانوں میں فتنے کا اندیشہ تھا۔لیکن اخباری خبر کے بعد ہمیں بھی حوصلہ ہوا اور بھر پور انداز میں پریس ریلیز شائع کی گئیں ۔",
    "تقریباً ہر مسلمان نے اِس کی تحقیق کری، کیونکہ مسلمانوں کے ایمان کی بات تھی۔کثیرطبقہ متفق ہوا ،کیونکہ تصویر اِتنی واضح تھی کہ اِس کو جھٹلانا مشکل تھا ۔اسلئے کئی لوگوں نے مشہور کر دیا کہ یہ بھی جادو ہے۔",
    "تقریباً ہر ملک میں چاند اور حجراسود کی تصاویر روشناس کرئی گئی۔سعودی عرب اور اُس کے ہم نوا سیخ پا ہوگئے، جیسے کہ حجراسود میں تصویر گوہرشاہی نے لگائی ہو، وہ کہتے ہیں کہ تصویر حرام ہوتی ہے، حجراسود پر کیسے آگئی؟",
    "یہ نہ سوچا کہ رب کی طرف سے کوئی بھی نشانی حرام نہیں ہو سکتی۔سعودی حکومت نے اپنی شرعی عدالتوں سے یہ فیصلہ لے لیا ہے کہ گوہرشاہی واجب القتل ہے۔",
    "اگر گوہرشاہی سر زمین مکہ میں قدم رکھے تو اُسے قتل کر دیا جائے۔پاکستان میں بھی سعودی نواز فرقے گوہرشاہی اور اُس کی تعلیمات کو مٹانے کی سرتوڑ کوشش کر رہے ہیں۔",
    "جھوٹے مقدمات، جن میں دفعہ295 کا भी مقدمہ بنا دیا گیا ہے۔اور کئی دفعہ گوہرشاہی پر قاتلانہ حملہ بھی کیا گیا ہے۔",
    "اب سورج پر بھی گوہرشاہی کی تصویر نمایاں ہو گئی ہے",
    "ہم نے حکومت پاکستان کو مقدمات کی وجہ اور تصاویر کی تحقیق کے لئے کئی بار آگاہ کیا۔",
    "لیکن اللہ کی اِن نشانیوں کو حکومتی سطح پر بھی فرقہ واریت کے دبائو کی وجہ سے جھٹلایا گیا، بلکہ نواز حکومت نے سندھ حکومت پر بھی زور دیا کہ گوہرشاہی کو کسی طریقے سے پھنسایا، دبایا، یا مٹایا جائے، اور اب ہم فوجی حکومت سے رابطہ کر رہے ہیں کہ وہ اِن نشانیوں کی انصاف سے تحقیق کرے اور کسی بھی ڈر, خوف, دبائو یا فرقہ واریت کی وجہ سے اللہ کی نشانیوں کو نہ جھٹلایا جائے۔",
    "اللہ کی یہ نشانیاں فتنہ ڈالنے کے لئے نہیں، بلکہ فتنہ مٹانے کے لئے ہیں۔اور اِس کا ثبوت ہے کہ گوہرشاہی کا درس جو امن اور اللہ کی محبت کا درس ہے، جس کے ذریعے ہر مذہب والے اپنی اصلاح کرنے میں لگ گئے۔",
    "اور آج ہندو، مسلم ، سکھ، عیسائی گوہرشاہی کی عقیدت کی وجہ سے ایک پلیٹ فارم پر جمع ہو رہے ہیں ، اور تاریخ میں یہ پہلا ریکارڈ ہے کہ کسی بھی مسلم کو گرجوں ، مندروں، اور گردواروں میں وعظ اور تقریر کے لئے مسندوں پر بٹھایا گیا ہو۔",
    "ایسے شخص کی دل جوئی کی جانی چاہئے جو ملک کے لئے باعث فخر ہو اور اللہ کی طرف مامور ہو۔اور اُس کی صداقت کے لئے اللہ نشانیاں دکھا رہا ہو، اور جس کی نظر سے لوگوں کے دل اللہ اللہ میں لگ کر اللہ کے محبّ بن گئے ہوں۔",
    "لیکن دشمن ِ اولیاء اور دشمن ِ اہلِ بیت کے مولوی اور جماعتیں اِن کے خلاف سربستہ ہو گئیں ہیں۔بے بنیاد مقدموں ، بے بنیاد حربوں اور بے بنیاد پروپیگنڈوں کے ذریعے عوام کا روخ حجر اسود سے ہٹانے کی کوشش کی جارہی ہے۔",
    "جبکہ یہ بہت نازک اور اہم مسئلہ ہے، مسلمانوں کے ایمان کا خطرہ ہے۔تو اس کی تحقیقات کے لئے خاموشی کیوں ہے؟اِس کے متعلق پوری دنیا میں اِتنا منفی اور مثبت پروپیگنڈا ہو چکا ہے کہ اب اس کو دبانا مشکل ہے۔",
    "ادھر ولیوں کو ماننے والے علماء سو گوہرشاہی سے بغض و حسد کی وجہ سے گونگے بن گئے ہیں ۔تصویر کو واضح ہونے کی صورت میں جھٹلانا مشکل ہو گیا، تو کہتے ہیں کہ چاند پر جادو چل گیا،جبکہ حضور ؐ نے کہا تھا کہ چاند پر جادو نہیں ہوسکتا، پھر کہتے ہیں حجر اسود بھی جادو کی لپیٹ میں آگیا ہے۔",
    "اگر کعبہ بھی جادو کی زد میں آگیا ہے، توپھر مسلم کے پاس تحفظ کی کون سی جگہ ہے؟مثال دیتے ہیں کہ حضورؐ پر بھی جادو ہو گیا تھا، کعبہ حضور ؐ سے افضل نہیں ہے۔",
    "بے شک حضورؐ پر جادو ہوگیا تھا 。لیکن اُس کے توڑ کے لئے سورۃ والناس آ گئی تھی۔",
    "تم بھی والناس کے ذریعے چاند اور حجراسود پر پھونکیں مارو ، اگر یہ تصویر نہ مٹیں بلکہ پہلے سے بھی زیادہ روشن ہوجائیں تو پھر تمہیں حق کو تسلیم کرنا پڑے گا۔ورنہ پھر تمہارے اندر ابو جہل ہی ہے۔"
  ]
};

window.PRELOADED_TEXTS["eye-witness-accounts-of-a-few-selected-loving-souls"] = {
  "title": "چند محب ارواح کے چشم دید واقعے",
  "sentences": [
    "چند محب ارواح کے چشم دید واقعے",
    "ایک ازلی روح کا واقعہ:",
    "میں امریکہ میں نصف شب کے قریب ایک جنگل سے گزر ا، دیکھا ایک شخص ایک درخت کے آگے سجدہ ریز ہو کر گڑگڑا رہا ہے۔تقریباً ایک گھنٹہ بعد میری واپسی ہوئی، ابھی بھی وہ اسی حالت میں تھا، میں قریب جاکر رُک گیا، اُس نے مجھے محسوس کر کے سجدے سے سر اُٹھایا اور کہا:مجھے ڈسٹرب کیوں کیا؟میں نے کہا:میں بھی رب کی تلاش میں ہوں، لیکن درخت سے کیسے رب ملے گا؟بہتر تھا کسی مذہب کے ذریعے رب کو حاصل کرتا!کہنے لگا:بائبل، قرآن یا جو بھی آسمانی کتابیں ہیں، میں اُنکی  (Original)اوریجنل زبان نہیں جانتا اور ان کتابوں کے جو ترجمے ہوئے ہیں،میں اُن سے مطمئن نہیں، کیونکہ ان میں زبردست تضاد ہے جس کی وجہ سے یہ یقین نہیں ہوسکتا کہ یہ کسی ایک ہی خدا کی طرف سے بھیجی ہوئی کتابیں ہوں۔ ایک کتاب میں لکھا ہے کہ عیسیٰ میرا بیٹے ہے جبکہ دوسری کتاب میں ہے کہ میرا کوئی بیٹے  وغیرہ نہیں ہے۔ایک عرصہ اُن کے مطالعہ میں میرا وقت اور عمر برباد ہوئی۔ میں نے اب دوسرا راستہ اختیار کیا ہے کہ یہ درخت اتنا خوبصورت ہے، اس کا مقصد رب اس سے محبت کرتا ہے، ہوسکتا ہے اِسی کے ذریعے میری رب تک رسائی ہوجائے۔یہ کوئی ازلی محبّ روح تھی جو اپنی عقل کے مطابق رب کی تلاش میں تھی۔کیا ایسے لوگ دوزخ میں جاسکتے ہیں ؟جو کہ معذور کہلاتے ہیں اور یہی کتے سے بھی قطمیر بن جاتے ہیں، جبکہ حضرت قطمیر کا بھی کوئی مذہب نہیں تھا۔",
    "Arizona ایریزوناکی مِس کیتھرین نے واقعہ سُنایا کہ:",
    "میں نے انجیلا سے ذکر قلبی کی اجازت لی، انجیلا نے کہا:سات دِن کے اندر اندر اگر دِل میں اللہ اللہ شروع ہوگئی تو سمجھنا کہ رب نے تمہیں قبول کرلیا ہے، ورنہ تیری زندگی فضول ہے۔جب سات دِن کی محنت سے بھی میرا ذکر جاری نہ ہوا تو ایک رات مجھے سخت رونا آیا۔میں خوب گڑگڑائی اُسی رات میرے اندر اللہ اللہ شروع ہوگئی جو تین سال سے جاری ہے۔",
    "کیتھرین عمر کی قائل نہیں بلکہ تندرستی کی قائل ہے، اِسی طرح وہ مذہب کی بھی قائل نہیں بلکہ اُس کی محبت کی قائل ہے۔اُس کا کہنا ہے کہ اِس ذکر کی وجہ سے میرے دِل میں رب کی محبت میں اضافہ ہوتا جارہا ہے، میرے لئے یہی کافی ہے۔",
    "ایک ہندو گرو سے ملاقات:",
    "میں اُس وقت سیون کی پہاڑیوں میں تھا، کبھی کبھی لعل شہباز کے دربار چلا جاتا Executive ایک شخص دربار کے باہر برآمدے میں بیٹھا ہوا تھا، بہت سے ہندو مذہب کے لوگ اُس کے گِرد بڑی عقیدت سے جمع تھے پوچھا:یہ کون بزرگ ہے؟",
    "کہنے لگے یہ ہندوؤں کا گرو ہے، روشن ضمیر بھی ہے اِسی کے ذریعے ہماری درخواستیں لعل سائیں تک پہنچتی ہیں اور ہمارے کام ہوجاتے ہیں۔بہت سے مسلمان بھی اُس کی عزت کرتے تھے۔",
    "ایک دن میراایک ٹیلے سے گُزر ہوا دیکھا وہی شخص سامنے ایک بُت رکھ کر سجدے کی حالت میں کچھ پڑھ رہا ہے۔دوسرے دن دربار میں ملاقات ہوئی، میں نے کہا: تجھ جیسے روشن ضمیر کا مٹی کے بُت کو پوجنا میری سمجھ سے باہر ہے۔",
    "اُس نے جواب دیا : میں بھی اِسے کوئی رب نہیں سمجھتا البتہ میرا عقیدہ ہے اور تمہاری کتابوں میں بھی لکھا ہے کہ اللہ نے انسان کو اپنی صورت پر بنایا اس وجہ سے طرح طرح کی صورتیں بنا کر پوجتا ہوں ،پتا نہیں کون سی صورت رب سے مل جائے۔اُس نے کہا: تو بھی روشن ضمیر ہے بتا کہ اللہ کی صورت کیسی ہے اور کس بُت سے ملتی ہے؟ تاکہ میں اُسے من میں بسا سکوں ۔",
    "میری عمر کوئی سولہ سترہ کے لگ بھگ تھی۔اپنے خاندانی بزرگ بابا گوہر علی شاہ کے دربار پر ایک دِن سورۃ مزّمل کی تلاوت کر رہا تھا اتنے میں ایک لمبے قد کا آدمی فقیری حُلیے میں میرے سامنے آیا اور کہنے لگا:خواہ مخواہ چنے چبا رہا ہے، بزرگ صورت تھا میں خاموش رہا لیکن دِل میں یہی تھا کہ یہ ضرور کوئی شیطان ہے جو مجھے تلاوت سے روک رہا ہے۔عرصہ گزر گیا جب ذکر ِقلب جاری ہوا تو میری عمر پینتیسسال کے لگ بھگ تھی۔بتائے ہوئے طریقے سے زبان سے سورۃ مزّمل کی آیت پڑھتا پھر خاموش ہوجاتا کہ دِل پڑھے پھر دِل سے اِسی آیت کی آواز آتی۔ ایک دِن اِسی مشق میں مگن اور مسرور تھا کہ پھر وہی شخص اُسی حلیے میں ظاہر ہوا اور کہنے لگا:اب تُو قرآن پڑھ رہا ہے۔جب تک تریاق معدے میں نہ جائے شفا نہیں ہوتی، جب تک کلام ِالٰہی دِل میں نہ اُترے کوئی بات نہیں بنتی اُس نے شعر سنایا۔",
    "زبانی کلمہ ہر کوئی پڑھدا ۔۔۔۔۔۔۔ دل دا پڑھدا کوئی ھو  دِل دا کلمہ عاشق پڑھدے ۔۔۔۔۔۔۔ کی جانن یار گلوئی ہو",
    "داتا دربار کی مسجد میں جب نماز سے فارغ ہوا دیکھا ایک عمر رسیدہ شخس نمازیوں کی جوتیاں سیدھی کر رہا ہے۔ میں نے بھی یہ محسوس کی کہ سوائے جوتیاں سیدھی کرنے کے اُس نے کوئی نماز نہیں پڑھی کیونکہ میں پچھلی صف میں تھا، جاتے وقت میں نے کہا:آپ نے نماز تو نہیں پڑھی، اِن جوتیوں سے آپ کو کیا ملے گا؟کہنے لگا: نماز تو عمربھرنہیں پڑھی اب بڑھاپے میں نماز سے بخشش کی کیا امید رکھوں۔بس ایک امید پر قائم ہوں کہ اتنے لوگوں میں سے کوئی ایک تو رب کا دوست ہو گا، شاید اِس اَدا سے ہی وہ یا اُس کا یار خوش ہوجائے۔",
    "میں نے کہا :نماز سے بڑھ کر کوئی اَدا نہیں۔کہنے لگا: یار سے بڑھ کر کوئی چیز نہیں اگر وہ راضی ہوجائے!تین سال کی چلہ کشی کے بعد ایک دِن محفل ِحضوری نصیب ہوئی ، دیکھا وہی شخص یار کے قدموں میں تھا۔پھر یہ شعر آیاکہ گناہگار پہنچے درِ پاک پر…زاہد و پاڑسا دیکھتے رہ گئے"
  ]
};

window.PRELOADED_TEXTS["a-divine-phenomenon"] = {
  "title": "a-divine-phenomenon",
  "sentences": [
    "کرشمۂ قدرت",
    "سیدنا حضرت ریاض احمد گوہر شاہی ش کے دائیں ہاتھ پر اسمِ ”محمد“ ﷺاور بائیں ہاتھ کی انگلیوںپر اسمِ ذات ”اللہ“ نمایاں ہے",
    "نوٹ",
    "کچھ لوگوں کو اعتراض ہے کہ الٹے ہاتھ کی انگلیوں پر اسمِ اللہ کیوں ہے؟اگر انگلیاں ہم نے بنائی ہوں یا کسی بھی طریقے سے ہم نے لکھوایا ہو تو ہم مجرم ہیں،یہ تو اللہ بہتر جانتا ہے کہ یہ اتفاق ہے یا کوئی کرشمہ قدرت!"
  ]
};

window.PRELOADED_TEXTS["an-insight-into-the-manifestation-of-human-images-in-the-moon-mars-and-various-other-planets"] = {
  "title": "مریخ اوردیگر سیاروں پر شبیہ کا راز",
  "sentences": [
    "مریخ اوردیگر سیاروں پر شبیہ کا راز",
    "حضرت عیسیٰ کی ہستی کسی تعارف کی محتاج نہیں ہے کیونکہ وہ اللہ کے بہت قریب ہیں۔ اُن کی تصاویر کئی سیاروں اور کئی مقامات پر ظاہر ہو رہی ہیں۔ موجودہ زمانے کے بہت سے لوگ اُن سے ملاقات کا شرف حاصل کرچکے ہیں۔ جبکہ دوسری طرف گوہر شاہی جو روئے زمین پر موجود ہیں اُن کا کوئی ایک مسکن نہیں، پوری دنیا میں گھومتے رہتے ہیں۔ مریخ کے علاوہ دوسرے سیاروں میں بھی اُن کی تصویریں دیکھی جا سکتی ہیں۔ اور انٹرنیٹ (www.goharshahi.com) پر اُن کی کتابیں پڑھی جا سکتی ہیں۔ ان کا تعلق پاکستان سے ہے۔ وہ صوفی سلسلے سے تعلق رکھتے ہیں۔ حضرت گوہر شاہی فرماتے ہیں کہ میں نبی نہیں ہوں لیکن مجھے محمدﷺ اور عیسیٰ اور دوسرے نبیوں کی حمایت حاصل ہے۔ وہ کہتے ہیں ”اگر کسی کا مذہب ہے لیکن اُس کے دل میں اللہ کی محبت نہیں ہے، اس سے وہ بہتر ہیں جن کا کوئی مذہب نہیں لیکن اللہ کی محبت ہے“۔",
    "مسلم علماء اُن کو کہتے ہیں کہ تم کہو کہ مسلمان سب سے اچھے ہیں۔ لیکن وہ کہتے ہیں”سب سے اچھا وہ ہے جس کے دل میں اللہ کی محبت ہے خواہ وہ کسی بھی مذہب سے ہو“۔ مسلم علماء کہتے ہیں کہ کلمۂ محمدی پڑھے بغیر کوئی جنت میں نہیں جا سکتا۔ وہ کہتے ہیں اِس جسم کو ادھر ہی رہنا ہے، روحوں کو جنت میں جانا ہے۔ چمکتی ہوئی روحیں جنت میں جا کر ہی کلمہ پڑھ لیں گی۔ وہ کہتے ہیں کلمے کا مطلب کسی بھی نبی کے کلمے سے مراد ہے۔ مسلمانوں کا ایک فرقہ کہتا ہے کہ یہ تصوف اوردل کی تعلیم سب باطل ہے۔ لیکن وہ کہتے ہیں کہ دل کی پاکیزگی کے بغیرسب کچھ باطی، رائیگاں اور چھلکے کی مانندہے۔",
    "مسلم عقیدے میں ایک دفعہ جنم ہوتا ہے۔ لیکن حضرت گوہر شاہی نے کتاب دین الٰہی میں لکھا ہے کہ دنیاوی روحوں کا جنم کئی بار ہوتا ہےجبکہ صرف آسمانی روح کاجنم ایک بار ہوتا ہے۔",
    "اُن کی انہی تعلیمات کی وجہ سے بہت سے مسلمان اُن کے دشمن ہوگئے ہیں ان ہی بنا پر حکومتِ پاکستان نے کتاب دین الٰہی پر پابندی لگا دی ہے۔اُنہیں کئی دفعہ بم کے حملوں سےاُڑانے کی کوشش کی گئی۔",
    "مسلم کی کئی تنظیموں نے لاکھوں روپے اُن کے سر کی قیمت رکھی ہوئی ہے۔ جبکہ حکومت پاکستان نے اُنہیں توہین مذہب کے کیس میں ملوث کیا ہوا ہے۔",
    "وہ کسی مذہب کا پرچار نہیں کرتےبلکہ اللہ کی محبت اور عشق کو دلوں میں اُتارنے کا طریقہ سکھاتے ہیں۔ وہ کہتے ہیں کہ جب تمہارا تعلق اللہ سے جڑ جائے گاتو وہ خود ہی تمہیں ہدایت کا راستہ دکھائے گا۔",
    "کئی لوگوں کو دورانِ مشق دل پر اللہ لکھا نظر آتا ہے۔ وہ کہتے ہیں جس زبان کا بھی لفظ اللہ کی طرف اشارہ کرتا ہے وہ قابلِ تعزیم اور قابل فیض ہے۔",
    "ہر مذہب کے لوگ اُنہیں پیار کرتے ہیں بلکہ امریکہ، برطانیہ، افریقہ، یورپ، مڈل ایسٹ اور ایشیاءمیں کئی چرچوں، گُردواروں، مندروں اور مسجدوں میں وہ خطاب کر چکے ہیں۔",
    "بہت سے بیمار لوگ جنہیں ڈاکٹروں نے لاعلاج قرار دے دیا تھا وہ بھی اُن کے دم کے پانی سے صحت یاب ہو چکے ہیں۔",
    "اور وہ اس اللہ کی محبت کی تعلیم کو عام کرنے اور بیماریوں کے روحانی علاج کیلئے لندن میں آل فیتھ اسپریچوئیل آرگنائزیشن کے نام سے ایک بہت بڑا ادارہ فری کھولنے کا پلان کرچکے ہیں جو اسی سال عالمگیر کام کرنا شروع کردے گا۔",
    "آپ سے گزارش ہے کہ کسی بھی مذہبی، ملکی اور نسلی تعصب کی وجہ سے رب کی نشانیوں کو جھٹلانےکی جرأت نہ کریں",
    "شاید یہ بندہ رب نے تمہاری اصلاح اور امداد کے لئے بھیجا ہو۔ اسے ڈھونڈیں اور ذاتی طور پر اس کی ریسرچ کریں۔ اگر کوئی گروہ یا ادارہ ان کے متعلق معلومات چاہتا ہو تو ہم سے رابطہ کریں، ہم منصفانہ پوری پوری معلومات مفت فراہم کریں گے۔ اگر ممکن ہوا تو اُن سے ملاقات کا بھی اہتمام کرا دیں گے۔ ہمارا ادارہ عرصہ7سال سے برطانیہ میں اُن تعلیمات کودنیا کے چپے چپے میں پھیلانے کی کوشش کررہے ہیں۔ جبکہ ادارہ آل فیتھ اسپریچوئیل آرگنائزیشن آئیرلینڈ، صوفی مومنٹ امریکہ اور انجمن سرفروشان اسلام پاکستان رجسٹرڈ بھی ہم سے منسلک ہوچکے ہیں۔",
    "ریگز انٹرنیشنل",
    "ناسا نے بڑی مشکل سے، کئی سیاستدانوں کے اسرار پر بڑے عرصے کے بعد مریخ پر تصویر کا اقرار کیا ہے جبکہ دوسرے سیارو کی تصویروں کو چھپائے ہوئے ہے۔اب اسی طرح مشابہت کی تصدیق کیلئے حیل وحجت کررہا ہے.",
    "یہ تصاویر مارک جے کالوٹو کی کتاب مارشین اینگماز سے لی گئی ہیں. یہ تصاویر روشنی اور تاریکی میں تناسب کے پانچ مختلف درجے دکھاتی ہیں۔یہاں موجود سب سے زیادہ تناسب رکھنے والی تصویر کی مماثلت ناسا کی اُس تصویر 35A72سے ہے جو وائکنگ نے بھیجی تھی۔"
  ]
};

window.PRELOADED_TEXTS["appeal"] = {
  "title": "اپیل",
  "sentences": [
    "گورنمنٹ آف پاکستان سے",
    "عظیم روحانی شخصیت سیدنا ریاض احمد گوہر شاہی",
    "بانی و سرپرست عالمی روحانی تحریک انجمن سرفروشان اسلام رجسٹرد کی",
    "اپیل",
    "میں حکومتِ پاکستان اور اس کے عمل داران سے اپیل کرتا ہوں کہ چاند اور حجر اسود پر تصاویر اور شبیہ کے متعلق مکمل تحقیقات کرائیں اگر یہ درست ثابت ہوں تو میری پژصت پناہی کریں تاکہ پوری دنیا میں اللہ کی محبت کا پرچاراورتمام مذاہب کے دلوں کو ایک کرنے میں آسانی ہو۔ اور عوام بھی ایک سمت کا تعین کر سکیں۔",
    "اگر مندرجہ بالا واقعات غلط ثابت ہوں تو حکومت کسی بھی سزایا بندش کی مجاز ہے۔",
    "بقلمِ خود",
    "ریاض احمد گوہر شاہی"
  ]
};

window.PRELOADED_TEXTS["black-stone"] = {
  "title": "حجرِ اسود",
  "sentences": [
    "حجرِ اسود",
    "محکمۂ تعلیم حکومتِ پنجاب کی پبلش کی ہوئی اِس دینیات کی کتاب میں حجر اسود کی تصویر میں حضرت گوہر شاہی کی شبیہ واضح طور پر نظر آتی ہے",
    "مرزا لائبریری مکہ کا شائع شدہ",
    "اِس تصویر کی نشاندہی خطوط کے ذریعہ کی گئی ہے",
    "25 سال کی ہی عمر میں ”جُسہ گوہر شاہی“ کو باطنی لشکر کے سالار کی حیثیت سے نوازا گیا تھا  اُس عمر اور اُس وقت کی نشاندہی، حجر اسود اورساتھ دی ہوئی تصویر میں ملاحظہ ہو"
  ]
};

window.PRELOADED_TEXTS["chapter-of-muraqibah-(transcendental-meditation)"] = {
  "title": "بابت مراقبہ",
  "sentences": [
    "بابت مراقبہ",
    "بہت سے لوگ روحوں ( لطائف ، شکتیاں) کی بیداری اور روحانی طاقت سیکھے بغیر مراقبہ کرنے کی کوشش کرتے ہیں۔ ان کا یا تو مراقبہ لگتا ہی نہیں یا شیطانی وارداتیں شروع ہوجاتی ہیں۔ مراقبہ انتہائی لوگوں کا کام ہے جنکے نفس پاک اور قلب صاف ہوچکے ہوں۔عام لوگوں کا مراقبہ نادانی ہے خواہ کسی بھی ظاہری عبادت سے کیوں نہ ہو! روحوں کی طاقت کو نور سے یکجا کرکے کسی مقام پر پہنچ جانے کا نام مراقبہ ہے۔",
    "ولائت نبوت کا چالیسواں حصّہ ہے",
    ":نبی کا ہر خواب،مراقبہ یا الہام وحی صحیح ہوتا ہے اِسے تصدیق کی ضرورت نہیں۔ لیکن ولی کے سو(۱۰۰) میں سے چالیس(۴۰) خواب مراقبے یا الہامات صحیح اور باقی غلط ہوتے ہیں اور اِن کی تصدیق کیلئے علم باطن کی ضرورت ہے کہ:",
    "بے علم نتواں خدارا شناخت",
    "سب سے ادنیٰ مراقبہ قلب کی بیداری کے بعد لگتا ہے جو کہ ذکر قلب کے بغیر ناممکن ہے۔ایک جھٹکے سے آدمی ہوش و حواس میں آجاتا ہے۔ استخارے کا تعلق بھی قلب سے ہے۔اس سے آگے روح کے ذریعے مراقبہ لگتا ہے۔تین جھٹکوں سے واپسی ہوتی ہے۔تیسرا مراقبہ لطیفہ انا اور روح سے اکھٹا لگتا ہے۔روح بھی جبروت تک ساتھ جاتی ہے جیسا کہ جبرائیل حضور پاک کے ساتھ جبروت تک گئے تھے۔ایسے لوگوں کو قبر میں بھی دفنا آتے ہیں مگر اُنہیں خبر نہیں ہوتی ایسا مراقبہ اصحابِ کہف کو لگا تھا جو تین سو(۳۰۰) سال سے زائد عرصہ غار میں سوتے رہے۔ ایسا مراقبہ جب غوث پاک کو جنگل میں لگتا تو وہاں کے مکین ڈاکو،آپ کو مردہ سمجھ کر قبر میں دفنانے کیلئے لے جاتے تھے لیکن دفنانے سے پہلے ہی وہ مراقبہ ٹوٹ جاتا۔",
    "اللہ کی طرف سے خاص الہام اور وحی کی پہچان:",
    "जब انسان سینے کی مخلوقوں کو بیدار اور منور کرکے تجلیات کے قابل ہوجاتا ہے تو اُس وقت اللہ اُس سے همکلام ہوتا ہے۔ یوں تو وہ قادر ِ مطلق ہے کسی بھی ذریعے انسان سے مخاطب ہوسکتا ہے لیکن اُس نے اپنی پہچان کیلئے ایک خاص طریقہ بنایا ہوا ہے تا کہ اُس کے دوست شیطان کے دھوکے سے بچ سکیں۔ سب سے پہلے سریانی زبان میں عبارت سالک کے دِل پر آتی ہے اور اُس کا ترجمہ بھی اُسی زبان میں نظر آتا ہے جس کا وہ حامل ہے ۔وہ تحریر سفید اور چمکدار ہوتی ہے اور آنکھیں خود بخود بند ہوکر اُسے دیکھتی ہیں۔پھر وہ تحریر قلب سے ہوتی ہوئی لطیفہ سری کی طرف آتی ہے جس کی وجہ سے زیادہ چمکنا شروع ہوجاتی ہے ۔پھر وہ تحریر لطیفہ اخفیٰ کی طرف آتی ہے،اخفیٰ سے اور چمک حاصل کر کے زبان پر چلی جاتی ہے اور زبان بے ساختہ وہ تحریر پڑھنا شروع کردیتی ہے ۔اگر یہ الہام شیطان کی طرف سے ہو تو منور دِل اُس تحریر کو مدھم کردیتا ہے، اگر تحریر زور آور ہے تو لطیفہ سری یا اخفیٰ اُس تحریر کو ختم کردیتے ہیں۔بالفرض اگر لطیفوں کی کمزوری کی وجہ سے وہ تحریر زبان پر پہنچ بھی جائے تو زبان اُسے بولنے سے روک لیتی ہے۔",
    "یہ الہام خاص ولیوں کیلئے ہوتا ہے جبکہ عام ولیوں کو اللہ تعالیٰ فرشتوں یا ارواح کے ذریعے پیغام پہنچاتا ہے .اور جب خاص الہام کی تحریر کے ساتھ جبرائیل بھی آجائیں تواُسے وحی کہتے ہیں جو صرف نبیوں کیلئے مخصوص ہے۔"
  ]
};
