if (typeof window.PRELOADED_TEXTS === 'undefined') { window.PRELOADED_TEXTS = {}; }

window.PRELOADED_TEXTS["the-religion-of-god"] = {
  "title": "دین ِ الٰہی",
  "sentences": [
    "دین ِ الٰہی",
    "تمام دین اس دنیا میں نبیوں کے ذریعے بنائے گئے۔ جبکہ اس سے پہلے خود عشق، خود عاشق، خود معشوق تھا۔اور وہ روحیں جو اس کے قرب، جلوے اور محبت میں تھیں وہی عشق الٰہی، دین الٰہی اور دین ِحنیف تھا۔ پھر اُن ہی روحوں نے دنیا میں آکر اُس کو پانے کیلئے اپنا تن من قربان کردیا۔یہ پہلے خاص تک تھا، اب روحانیت کے ذریعے عام تک بھی پہنچ گیا۔",
    "حدیث:حضرت ابو ہریرہ:مجھے حضور پاک سے دو علم حاصل ہوئے ایک تمہیں بتا دیا، دوسرا بتاؤں تو تم مجھے قتل کردو!",
    "جب پانی کے حوض سے خشک کتابیں نکلیں تو مولانا روم نے کہا:ایں چیست؟ شاہ شمس نے کہا: \"ایں آں علم است کہ تو نمی دانی۔\"",
    "جب موسیٰ نے کہا کہ کیا کچھ اور علم بھی ہے؟ تو اللہ نے کہا کہ خضر کے پاس چلا جا!",
    "ہر نمازی کی دُعا:\"اے اللہ مجھے اُن لوگوں کا سیدھا راستہ دکھا جن پر تیرا انعام ہوا!\"",
    "علامہ اقبالؒ: اس کو کیا جانے بچارے دو رکعت کے امام!",
    "وہ روحیں جو ازل سے ہی بامرتبہ ہیں۔اللہ جن سے محبت کرتا ہے اور جو اللہ سے محبت کرتی ہیں۔دنیا میں آکر بھی رب کی نام لیوا ہوئیں،مثلاً عیسیؑ زچگی میں ہی بول اُٹھے تھے کہ میں نبی ہوں جبکہ حضرت مریم کو پیدائش سے پہلے ہی"
  ]
};

window.PRELOADED_TEXTS["the-return-of-jesus-jesus-christ-meets-gohar-shahi-in-america"] = {
  "title": "عیسیٰ علیہ السلام کی حضرت ریاض احمد گوہر شاہی سے امریکہ میں ملاقات",
  "sentences": [
    "29 مئی 1997 میں ایل ماونٹے لاج طاؤس نیو میکسیکو امریکہ میں ٹھرا ہوا تھا۔ رات کے دوسرے پہر مجھے اپنے کمرے میں کسی کی موجودگی کا احساس ہوا۔ کمرے میں ناکافی روشنی تھی۔ مجھے لگا کہ میرا کوئی عقیدت مند ہےجو بنا اجازت کمرے میں آگیا ہے۔ میں نے اس شخص سے پوچھا، کیوں آئے ہو؟اُس شخص نے جواباً کہا کہ میں آپ سے ملنے آیا ہوں۔ میں نے اسی اثناء میں کمرے کی لائٹ روشن کر دی۔ میں نے دیکھا کہ ایک حسین و جمیل نوجوان میرے سامنے کھڑا ہے، جسے میں نہیں جانتا تھا۔ اس شخص کو دیکھ کر میرے لطائف خوشی سے جھوم اُٹھے اور ایسی کیفیت پیدا ہوگئی جیسی عالم بالا کی محافل اور نبیوں کی موجودگی میں ہوتی ہے۔ مجھے احساس ہوا کہ اس شخص کو متعدد زبانوں پر عبور حاصل ہے۔ اس نوجوان نے مجھے بتایا کہ وہ عیسیٰ ابن مریم ہے۔ اور فی الحال امریکہ میں ہے۔ میں نے اس سے پوچھا، تم کہاں رہتے ہو؟ اس شخص نے جواب دیا، نہ ہی پہلے میرا کوئی ٹھکانہ تھا اور نہ ہی اب ہے!",
    "جب حضرت ریاض احمد گوہر شاہی سے ملاقات کے دوران ہونے والی مزید گفتگو کی گزارش کی گئی تو آپ نے فرمایا کہ عیسیٰ ابن مریم اور میرے درمیان جو گفتگو ہوئی ہے وہ فی الحال ایک راز ہے، لیکن مستقبل قریب میں کسی مناسب وقت پر میں اس راز کو فاش کرونگا۔ حضرت گوہر شاہی نے مزید فرمایا کہ میں چند روز بعد ٹوسان ایری زونا (امریکی ریاست) جانے کا اتفاق ہوا۔ یہاں کسی نے مجھے ایک تصویر دکھائی اور کہا کہ یہ عیسیٰ ابن مریم ہیں۔ میں نے فوری طور پر تصویر والے نوجوان کو پہچان لیا। کیونکہ یہ تصویر اُسی نوجوان کی تھی جو میرے کمرے میں طائوس میں آیا تھا۔ میں نے تصویر کے مالک سے اس تصویر کی تفصیلات دریافت کی۔ اس نے مجھے بتایا کہ کچھ مقدس مقامات کی زیارت کیلئے گئے جہاں انہوں نے تصاویر اُتاریں۔ جب کیمرے کی فلم develop کی گئی تو حیرت انگیز طور پر اس نوجوان کی تصویر وآئی حالانکہ کسی نے بھی اس نوجوان کو وہاں نہیں دیکھا اور نہ ہی اس کی تصویر کھینچی۔ بہرحال میں نے اس نوجوان یعنی عیسیٰ ابن مریم کی تصویر لے لی اور چاند میں ظاہر ہونے والی کئی تصاویر سے اس کو ملا کر دیکھا۔ چاند میں ظاہر ہونے والی تصاویر میں سے ایک تصویر اس سے مشابہت رکھتی تھی۔ مجھے یقین ہو گیا اور اس طرح میں نے تصدیق کر دی کہ یہ عیسیٰ ابن مریم کی حقیقی تصویر ہے۔",
    "حال ہی میں امریکہ میں ایک رسالےنے بائبل کے علماء کے حوالاجات سے عیسیٰ ابن مریم کی دوبارہ واپسی اور قرب قیامت میں ہونے والے واقعات سے متعلق مضمون شائع کیا۔ اس مضمون میں متعدد باتوں کا ذکر تھا خصوصی طور پر بائبل سے متعلقہ راز اور پیش گوئیاں تھیں جن کو ویٹی کن (روم اٹلی) نے جاری کیا تھا۔ بائ"
  ]
};

window.PRELOADED_TEXTS["the-subtlety-of-akhfa-(obscure)"] = {
  "title": "لطیفہ اخفیٰ",
  "sentences": [
    "اس کی نبوت اور علم حضور پاک کو ملا تھا",
    "یہ مخلوق سینے کے درمیان ہے۔ یا احد کا ذکر اس کیلئے وسیلہ ہے اس کا رنگ جامنی ہے اس کا تعلق بھی مقام وحدت کے اُس پردے سے ہے جس کے پیچھے تخت خداوند ہے۔",
    "پنج لطائف کا باطنی علم بھی پانچوں نبیوں کو بالترتیب حاصل ہوا اور ہر لطیفے کا آدھا علم نبیوں سے ولیوں تک پہنچا۔ اس طرح اس کے دس  حصّے بن گئے پھر ولیوں سے خاص(لوگ) اس علم سے مستفیض ہوئے۔ جبکہ ظاہری علم، ظاہری جسم، ظاہری زبان، ناسوت اور نفوس سے تعلق رکھتا ہے۔ یہ عام لوگوں کیلئے ہے اور اس کا علم ظاہری کتاب میں ہے جس کے تیس (۳۰)حصے ہیں ۔علم باطن بھی نبیوں پر وحی کے ذریعے نازل ہوا، اِس وجہ سے اِسے بھی باطنی قرآن بولتے ہیں۔قرآن کی بہت سی صورتیں بعد میں منسوخ کی جاتیں ، اُس کی وجہ یہی تھی کہ کبھی کبھی سینے کا علم بھی حضورؐ کی زبان سے عام میں ادا ہوجاتا جو کہ خاص کیلئے تھا، بعد میں یہ علم سینہ بہ سینہ ولیوں میں چلتا رہا اور اب کتب کے ذریعے عام کردیا گیا۔"
  ]
};

window.PRELOADED_TEXTS["the-subtlety-of-ana"] = {
  "title": "لطیفہ انا",
  "sentences": [
    "یہ مخلوق سر میں ہوتی ہے۔ بے رنگ ہے۔ \"یاھو\" کا ذکر اس کی معراج ہے اور یہی مخلوق طاقتور ہوکر خدا کے رُوبرو بے پردہ  ہمکلام ہوجاتی ہے۔یہ عاشقوں کا مقام ہے اس کے علاوہ کچھ خواص کو اللہ کی طرف سے اور دیگر مخلوقیں بھی عطا ہوجاتی ہیں، جیسے \"طفل ِ نوری\" یا  \"جُسہ ٔ توفیق الٰہی\"۔ پھر ان کا مرتبہ سمجھ سے بالا ہے۔",
    "لطیفہ انا کے ذریعے دیدار ِ الٰہی خواب میں ہوتا ہے",
    "جسۂ توفیق الٰہی کے ذریعے رب کا دیدار مراقبے میں ہوتا ہے",
    "اور طفل نوری والوں کا دیدار ہوش و حواس میں ہوتا ہے",
    "یہی پھر دنیا میں قدرت اللہ کہلاتے ہیں، چاہے کسی کو عبادت و ریاضت، اور چاہے کسی کو نظروں سے ہی مقام محمود تک پہنچا دیں، اِن کی نظروں میں :  چہ مسلم چہ کافر… چہ زندہ چہ مردہ ،سب برابر ہوتے ہیں جیسا کہ غوث پاکؓ کی ایک نظر سے چور قطب بن گیا۔ یا ابوبکر حواری یا منگا ڈاکو بھی ان لوگوں کی نظروں سے پیر بن گئے۔",
    "پانچوں مُرسل کو بالترتیب علیحدہ علیحدہ لطائف کا علم دیا گیا جس کی وجہ سے روحانیت میں ترقی ہوتی گئی .جس جس لطیفے کا ذکر کریگا اُن سے متعلق مُرسل سے تعلق اور فی"
  ]
};

window.PRELOADED_TEXTS["the-subtlety-of-khafi-(arcane)"] = {
  "title": "لطیفہ خفی",
  "sentences": [
    "اس کی نبوت اور علم عیسیٰ کو ملا تھا",
    "یہ سینے کے درمیان سے دائیں پستان کے درمیان ہوتی ہے اسے بھی ضربوں کے ذریعے یاواحد سکھایا جاتا ہے۔اس کا رنگ سبز ہے اور اس کی رسائی مقام وحدت سے ہے، اور اب چار بندوں کی عبادت سے درجہ اور بڑھ گیا۔"
  ]
};

window.PRELOADED_TEXTS["the-subtlety-of-qalb"] = {
  "title": "لطیفہ قلب",
  "sentences": [
    "گوشت کے لوتھڑے کو اُردو میں دِل اور عربی میں فواد بولتے ہیں اور اس مخلوق کو جو دِل کے ساتھ ہے، قلب بولتے ہیں۔اس کی نبوت اور علم آدمؑ کو ملا تھا۔ حدیث میں ہے کہ دِل اور قلب میں فرق ہے۔ اس دنیا کو ناسوت بولتے ہیں۔اس کے علاوہ اورجہان بھی ہیں، یعنی ملکوت، عنکبوت، جبروت، لاہوت، وحدت اور احدیت۔ یہ مقام ناسوت میں گولہ پھٹنے سے پہلے تھے اور ان کی مخلوقیں بھی پہلے سے موجود تھیں۔فرشتے ارواح کے ساتھ بنے۔ لیکن ملائکہ اور لطائف پہلے ہی سے ان مقامات پر موجود تھے بعد میں عالم ِ ناسوت میں بھی کئی سیاروں پر دنیا آباد ہوئی۔کوئی مٹ گئے اور کوئی منتظر ہیں۔ یہ مخلوق یعنی لطائف اور ملائکہ روحوں کے امر کن سے ۷۰ ہزار سال پہلے بنائے گئے تھے اور ان میں سے قلب کو مقام ِ محبت میں رکھا گیا اور اسی کے ذریعے انسان کا رابطہ اللہ سے جڑ جاتا ہے۔اللہ اور بندے کے درمیان یہ ٹیلی فون آپریٹر کی حیثیت رکھتا ہے۔ انسان پر دليل و الہامات اسی کے ذریعے وارد ہوتے ہیں۔جبکہ لطائف کی عبادات بھی اسی کے ذریعے عرش ِ بالا پر پہنچتی ہیں لیکن یہ مخلوق خود ملکوت سے آگے نہیں جاسکتی، اس کا مقام خلد ہے۔ اس کی عبادت بھی اندر اور تسبیح بھی انسان کے ڈھانچے میں ہے۔ اس کی عبادت کے بغیر والے جنتی بھی افسوس کرینگے کیونکہ اللہ نے فرمایا کہ’’ کیا ان لوگوں نے سمجھ رکھا ہے کہ ہم ان کو نیکوکاروں کے برابر کردینگے؟‘‘ کیونکہ قلب بھی روح انسانی کے ساتھ دیدار والے لافانی ولیوں کے جسم میں داخل ہونگے گے۔جنہوں نے ان کو دنیا میں اللہ اللہ سکھایا تھا وہاں بھی اللہ اللہ کرتے رہیں گے اور وہاں جاکر بھی ان کے مرتبے بڑھتے رہیں گے۔ اور جو ادھر دِل کے اندھے تھے وہ اُدھر بھی اندھے ہی رہیں گے۔ کیونکہ میدان عمل یہ دنیا تھی اور وہ ایک ہی جگہ ساکن ہوجائینگے۔عیسائیوں، یہودیوں کے علاوہ ہندو مذہب بھی ان مخلوقوں کا قائل ہے۔ ہندو  اِنہیں شکتیاں اور مسلمان انہیں لطائف کہتے ہیں۔ قلب دل کے بائیں طرف دو انچ کے فاصلے پر ہوتا ہے اس مخلوق کا رنگ زرد ہے۔ اس کی بیداری سے انسان زرد روشنی اپنی آنکھوں میں محسوس کرتا ہے۔بلکہ کئی عامل حضرات ان لطائف کے رنگوں سے لوگوں کا علاج بھی کرتے ہیں۔اکثر لوگ اپنے دِل کی بات برحق مانتے ہیں۔اگر واقعی دِل سچے ہیں تو سب دِل والے ایک کیوں نہیں؟ عام آدمی کا قلب صنوبری ہوتا ہے جس میں کوئی سُدھ بُدھ نہیں ہوتی، نفس اور خناس کے غلبے یا اپنے سیدھے پن کی وجہ سے غلط فیصلہ بھی دے سکتا ہے۔قلب صنوبری پر اعتماد نادانی ہے۔جب اس دِل میں اللہ کا ذکر شروع ہوجاتا ہے پھر اس میں نیکی بدی کی تمیز اور سمجھ آجاتی ہے اِسے قلب سلیم کہتے ہیں، پھر ذکر کی کثرت سے اس کا رُخ رب کی طرف مُڑ جاتا ہے اِسے قلبِ منیب کہتے ہیں، یہ دِل برائی سے روک سکتا ہے مگر یہ صحیح فیصلہ نہیں کر سکتا، پھر جب اللہ تعالیٰ کی تجلیات اس دِل پر گرنا شروع ہوجاتی ہیں تو اُسے قلب شہید کہتے ہیں۔ حدیث :",
    "شکستہ دِل"
  ]
};

window.PRELOADED_TEXTS["the-subtlety-of-sirri-(secret)"] = {
  "title": "لطیفہ سری",
  "sentences": [
    "اس کی نبوت اور علم موسیٰ ؑ کو ملا تھا",
    "یہ مخلوق سینے کے درمیان سے بائیں پستان کے درمیان ہوتی ہے۔ اس کو بھی یاحّی و یا قیوم کی ضربوں اور تصّور سے بیدار کیا جاتا ہے۔ اس کا رنگ سفید ہے۔ خواب یا مراقبے میں لاہوت تک پہنچ رکھتی ہے، اب تین مخلوقیں ذکر کررہی ہیں اور اس کا درجہ اُن دو سے بڑھ گیا۔"
  ]
};

window.PRELOADED_TEXTS["the-tenet-of-his-divine-eminence-gohar-shahi"] = {
  "title": "گوہرشاہی کا عقیدہ",
  "sentences": [
    "سب مذاهب کے نیکوں کاروں اور عابدوں کو ایک لائن میں کھڑا کردیا جائے، رب کو کہو: کس کو دیکھے گا؟",
    "جس طرح تیری نظر چمکتے ہوئے ستاروں پر پڑتی ہے۔ وہ مریخ ہو یا عطارد یا بے نام ستارہ،",
    " اِسی طرح رب بھی چمکتے ہوئے دِلوں کو دیکھتا ہے وہ مذہب والے ہوں یا بے مذہب!",
    "بِن عشق ِ دلبر کے سچل ،کیا کفر ہے، کیا اسلام ہے!",
    " تم رب کی تلاش میں مندروں چرچوں اور مسجدوں وغیرہ کی دوڑ لگاتے ہو! کیا تاریخ میں کوئی ثبوت ہے، کہ رب کو کسی نے بھی کسی بھی عبادتگاہ میں بیٹھا ہوا دیکھا ہو؟ ارے نادان! رب کا مسکن تیرا دِل ہے، اس کو دِل میں بسا، پھر دیکھ یہ عبادت گاہیں اور اِن میں عبادت کرنے والے تیری طرف دوڑ لگائیں گے۔بایزید بسطامیؒ فرماتے ہیں:’’ ایک عرصہ کعبہ کا طواف کرتا رہا، جب رب میرے اندر آیا، تو ایک عرصے سے کعبہ میرا طواف کر رہا ہے‘‘۔یہ عبادت گاہیں ثواب گاہیں ہیں جبکہ یہ دِل آماجگاہ ہے۔عبادت گاہوں میں تُو پکارے گا اور رب دِلوں میں پکارے گا۔",
    "عقل والوں کے نصیبے میں کہاں ذوقِ جنوں  ",
    "عشق والے ہیں جو ہر چیز لُٹا دیتے ہیں  ",
    "اللہ اللہ کئے جانے سے اللہ نہ ملے  ",
    "اللہ والے ہیں جو اللہ ملا دیتے ہیں",
    "ہر مذہب کا عقیدہ ہے کہ اُس کے نبی کی شان سب سے بلند ہے اور یہی عقیدہ اہل کتاب میں جنگوں کا سبب بنا،بہتر ہے تم روحانیت کے ذریعے نبیوں کی محفل میں پہنچ جاؤ پھر ہی پتہ چلے گا کہ کون کس مقام پر ہے اور کون کس درجہ پر ہے۔",
    "ضروری نوٹ",
    " ہر نبی کو اللہ نے خاص ناموں سے پکارا جو اُنکی امت کیلئے پہچان اور کلمے بن گئے۔یہ نام اللہ کی اپنی زبان سریانی میں تھے۔ اِنکے اقرار سے اُس نبی کی امت میں داخل ہوتا ہے۔ تین دفعہ اقرار شرط ہے، امت میں دا خل ہونے کے بعد ان الفاظوں کو جتنا بھی دُہرائے گا اُتنا ہی پاک"
  ]
};

window.PRELOADED_TEXTS["the-word-allah"] = {
  "title": "لفظ اللہ",
  "sentences": [
    "انسان پریشان رہتا ہے۔بہت سے لوگ اس علم کے ماہرین سے ستاروں کے حساب سے زائچہ بنوا کر نام رکھتے ہیں۔ جیسا کہ ابجد(ا۔ب۔ج۔د) (۱۔۲۔۳۔۴) کے دس (۱۰)عدد بنتے ہیں۔اسی طرح ہر نام کے علیحدہ اعداد ہوتے ہیں۔جب اللہ کے مختلف نام رکھ دئیے گئے تو ابجد کے حساب سے ایک دوسرے سے ٹکراؤ کا سبب بن گئے۔اگر سب ایک ہی نام سے رب کو پکارتے تو مذاہب جدا جدا ہونے کے باوجود اندر سے ایک ہی ہوتے۔پھر نانک صاحب اور بابا فرید کی طرح یہی کہتے:سب روحیں اللہ کے نور سے بنی ہیں، لیکن ان کا ماحول اور ان کے محلے علیحدہ ہیں۔",
    "جن فرشتوں کی دنیا میں ڈیوٹیاں لگائی جاتی ہے انہیں دنیا والوں کی زبانیں بھی سکھائی جاتی ہیں۔ اُمتیوں کیلئے ضروری ہے کہ اپنے نبی کا کلمہ جو نبی کے زمانے میں امت کی پہچان، فیض اور پاکیزگی کیلئے رب کی طرف سے عطا ہوا تھا ، اُسی طرح اُسی زبان میں کلمے کا تکرار کیا کرے۔ کسی کو کسی بھی مذہب میں آنے کیلئے یہ کلمے شرط ہیں۔جس طرح نکاح کے وقت زبانی اقرار شرط ہے جنتوں میں داخلے کیلئے بھی یہ کلمے شرط کردئیے گئے۔لیکن مغربی ممالک میں بیشتر مسلم اور عیسائی اپنے مذہب کے کلموں حتیٰ کہ اپنے نبی کے اصلی نام سے بے خبر ہیں۔ زبانی کلمے والے اعمال ِ صالح کے مُحتاج، کلمہ نہ پڑھنے والے جنت سے باہر، اور جن کے دِلوں میں بھی کلمہ اُتر گیا تھا وہی بغیر حساب کے جنت میں جائیں گے۔آسمانی کتابیں جو جس بھی زبان میں"
  ]
};

window.PRELOADED_TEXTS["the-number-of-souls-created-in-the-heaven-exceeded-the-limit"] = {
  "title": "آسمان پر روحیں حد سے زیادہ بن گئی تھیں:",
  "sentences": [
    "آسمان پر روحیں حد سے زیادہ بن گئی تھیں:",
    "مقرب روحیں اگلی صفوں میں تھیں۔عام روحوں کو اس دنیا میں بنائے ہوئے آدموں کی قوموں میں بھیجا۔جو کوئی کالی، کوئی سفید، کوئی پیلی اور کوئی لال مٹی سے بنائے گئے تھے۔انہیں جبرائیل اور ہاروت ماروت کے ذریعے علم سکھایا گیا۔جب زمین پر مٹی سے آدم بنائے جاتے، خبیث جِن بھی موقع پا کر اُنکے اور اُنکی اولاد کے جسموں میں داخل ہوجاتے اور انہیں اپنی شیطانی گرفت میں لینے کی کوشش کرتے۔پھر اُنکی قوم کے نبی، ولی اور اُن کی سِکھائی ہوئی تعلیمات چھٹکارے کا ذریعہ بنتی بے شمار آدم جوڑوں کی شکل میں بنائے گئے جن سے اولاد کا سلسلہ جاری ہوا لیکن کئی بار صرف اکیلی عورت کو بنایا گیا اور \"امرِ کُن\" سے اس کی اولاد ہوئی۔ وہ قومیں بھی اس دنیا میں موجود ہیں۔اس قبیلے میں صرف عورتیں ہی سردار ہوتی ہیں اور وہ موئنّث کی اولاد ہونے کی وجہ سے رب کو بھی موئنّث سمجھتے ہیں اور خود کو فرشتوں کی اولاد تصور کرتے ہیں، چونکہ اُنکے موئنّث آدم کی شادی’ یا مرد کے‘ بغیر ہی بچے ہوئے تھے۔یہی رسم اُن میں اب بھی چلی آرہی ہے۔ ان قبیلوں میں پہلے عورت کے کسی سے भी بچے ہوجاتے ہیں اور بعد میں کسی سے بھی شادی ہوجاتی ہے اور وہ اس کو معیوب نہیں سمجھتے۔ روحوں کے اقرار، قسمت، اور مراتب کی وجہ سے ان ہی جیسے آدم بناکر اُن ہی جیسی روحوں کو نیچے بھیجا گیا۔یہی وجہ ہے کہ ان کیلئے کوئی خاص دین ترتیب نہیں دیا",
    "روز ِ ازل والی جہنمی روح غیر مذہب کے گھر پیدا ہوجائیں۔اُسے کافر اور کاذب کہتے ہیں۔یہی لوگ منکر ِخدا، دُشمنِ انبیاء اور دُشمنِ اولیاء ہوتے ہیں۔ متکبر، سخت دِل اور مخلوق  ِخدا کو آزار پہنچا کرخوش ہوتے ہیں۔دوسرا درجہ مذہب میں آکر بھی مذہب سے دور ہوتا ہے۔ یہی روح اگر کسی مذہبی دیندار گھرانے میں پیدا ہوجائے تو اُسے منافق کہتے ہیں۔",
    "یہی لوگ گستاخ انبیاء، جلیس اولیاء اور مذاہب میں فتنہ ہوتے ہیں۔اِنی عبادت بھی ابلیس کی طرح بیکار ہوتی ہے۔ اِنہیں مذہب جنت میں لے جانے کی کوشش کرتا ہے لیکن مقدر دوزخ کی طرف کھینچتا ہے۔ چونکہ نبیوں، ولیوں کی امداد سے محروم ہوتے ہیں اسلئے شیطان اور نفس کے بہکاوے میں آجامدتے ہیں کہ تُو اتنا علم جانتا ہے اور اتنی عبادت کرتا ہے تجھ میں اور نبیوں میں کیا فرق ہے؟ پھر وہ اپنا باطن دیکھے بغیرخود کو نبی جیسا سمجھنا شروع ہوجاتے ہیں اور ولیوں کو اپنا محتاج سمجھتے ہیں۔پھر روحانیت اور کرامتوں کے اقراری نہیں ہوتے بلکہ اُسی عمل کے اقراری ہوتے ہیں جنکی اُن میں خود کی صلاحیت ہوتی ہے،حتیٰ کہ معجزوں کو بھی جادو کہہ کر جھٹلادیتے ہیں۔ابلیس کی طاقت کو مان لیتے ہیں لیکن انبیا ء و  اولیا ء کی طاقت کو مان لینا اِن کیلئے مشکل ہے۔",
    "ازل والی بہشتی روح اگر غیر مذہب یا گندے ماحول میں آجائے تو اُسے معذور کہتے"
  ]
};
